{
    "intents": [
        {
            "tag": "hello",
            "patterns": [
                "Selamat datang",
                "Salam kenal",
                "Halo, siapa di sana?",
                "Permisi, ada yang bisa bantu?",
                "Selamat pagi, ada yang bisa saya bantu?",
                "Hi, saya butuh info",
                "Hai, ada yang bisa dijelaskan?",
                "Hello, ILO siap membantu?",
                "Saya mau tanya sesuatu",
                "Selamat siang, bantuan dong",
                "Hai, saya baru di sini",
                "Halo, saya ingin bertanya",
                "Permisi, saya butuh bantuan",
                "Hi, ini tentang Infinite Learning ya?",
                "Ada yang bisa saya konsultasikan?",
                "Apa ini layanan informasi Infinite Learning?",
                "Boleh minta info tentang program di sini?",
                "Halo kak, Infinite Learning ya?",
                "Saya ingin tahu lebih lanjut, bisa bantu?",
                "Boleh ngobrol soal pelatihan di sini?"
            ],
            "responses": [
                "Halo! Selamat datang di Infinite Learning. Ada yang bisa ILO bantu?",
                "Hai! Senang bertemu denganmu. ILO siap membantu kamu!",
                "Selamat datang! Silakan tanyakan apa pun tentang Infinite Learning.",
                "Halo juga! ILO di sini untuk bantu kamu mengenal Infinite Learning lebih jauh.",
                "Halo! Semoga harimu menyenangkan. Yuk, mulai percakapannya!",
                "Halo! Selamat datang di Infinite Learning. Ada yang bisa ILO bantu?",
                "Hai! Senang bertemu denganmu. ILO siap membantu kamu!",
                "Selamat datang! Silakan tanyakan apa pun tentang Infinite Learning.",
                "Halo juga! ILO di sini untuk bantu kamu mengenal Infinite Learning lebih jauh.",
                "Halo! Semoga harimu menyenangkan. Yuk, mulai percakapannya!",
                "Hai! Selamat datang di Infinite Learning, kamu bisa tanya apa saja di sini!",
                "Halo! Senang kamu mampir. Ada info yang kamu butuhkan?",
                "Hai, ILO siap bantu kamu cari tahu soal Infinite Learning.",
                "Selamat datang! Silakan ajukan pertanyaanmu kapan saja.",
                "Halo juga! Kami senang membantu menjawab kebutuhanmu.",
                "ILO di sini untuk membantu kamu mengenal program-program Infinite Learning.",
                "Hai! Silakan, kamu bisa mulai dengan pertanyaan yang kamu punya.",
                "Senang bisa ngobrol denganmu! Ada yang ingin kamu ketahui?",
                "Halo, yuk kita bahas apa pun yang ingin kamu tahu seputar Infinite Learning.",
                "Hai! Terima kasih sudah menghubungi ILO. Siap bantu jawab pertanyaanmu!"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Saya pamit dulu ya",
                "Terima kasih banyak",
                "Sampai ketemu lagi",
                "Sekian dulu, makasih",
                "Selamat tinggal semuanya",
                "Bye, sampai jumpa lagi",
                "Saya keluar dulu",
                "Terima kasih atas bantuannya",
                "Udahan dulu ya, makasih",
                "Salam perpisahan",
                "Makasih ya, sampai nanti!",
                "Saya izin pamit dulu",
                "Terima kasih, saya sudah cukup jelas",
                "Sampai jumpa, ILO!",
                "Udah dulu ya, makasih infonya",
                "Saya tinggal dulu, terima kasih bantuannya",
                "Terima kasih, infonya sangat membantu!",
                "Oke, saya pamit, sampai lain waktu",
                "Nanti saya balik lagi kalau ada pertanyaan",
                "Makasih banyak ya, sampai ketemu!"
            ],
            "responses": [
                "Sama-sama! Jangan ragu untuk kembali jika ada pertanyaan lain.",
                "Sampai jumpa! Semoga harimu menyenangkan.",
                "Terima kasih telah berbicara dengan ILO. Sampai bertemu lagi!",
                "Senang bisa membantu! Sampai jumpa di lain waktu.",
                "Terima kasih! Semoga sukses selalu dalam perjalanan belajarmu bersama Infinite Learning.",
                "Sama-sama! Jangan ragu untuk kembali jika ada pertanyaan lain.",
                "Sampai jumpa! Semoga harimu menyenangkan.",
                "Terima kasih telah berbicara dengan ILO. Sampai bertemu lagi!",
                "Senang bisa membantu! Sampai jumpa di lain waktu.",
                "Terima kasih! Semoga sukses selalu dalam perjalanan belajarmu bersama Infinite Learning.",
                "Senang bisa membantu! Jangan sungkan kembali kapan pun.",
                "Terima kasih juga! Semoga harimu menyenangkan.",
                "Sampai jumpa! ILO selalu siap bantu kamu kapan saja.",
                "Jangan ragu untuk kembali ya kalau butuh info lainnya.",
                "Terima kasih sudah ngobrol dengan ILO. Sukses selalu!",
                "Bye! Semoga informasi tadi bermanfaat untuk kamu.",
                "Sampai ketemu lagi ya! Tetap semangat belajar.",
                "Terima kasih atas waktumu. ILO siap menyambut kamu lagi kapan pun.",
                "Salam hangat dari Infinite Learning! Sampai nanti.",
                "Kapan pun kamu butuh bantuan, ILO siap menemani!"
            ]
        },
        {
            "tag": "infinite_learning",
            "patterns": [
                "Apa itu Infinite Learning?",
                "Jelaskan tentang Infinite Learning",
                "Apa sih Infinite Learning?",
                "Infinite Learning tuh apa?",
                "Apa yang kamu ketahui tentang Infinite Learning?",
                "Bisa jelaskan mengenai Infinite Learning?",
                "Apa yang dimaksud dengan Infinite Learning?",
                "Bagaimana Infinite Learning dapat membantu pengembangan karir?",
                "Apa yang membuat Infinite Learning berbeda dari lembaga pelatihan lainnya?",
                "Apa visi dan misi dari Infinite Learning?",
                "Infinite Learning itu bagian dari perusahaan apa?",
                "Fokus program di Infinite Learning itu apa aja?",
                "Infinite Learning punya kerja sama dengan siapa?",
                "Apa tujuan utama dari Infinite Learning?",
                "Bagaimana cara Infinite Learning mendukung perkembangan karir?",
                "Apa keunggulan Infinite Learning dibanding tempat lain?",
                "Apakah Infinite Learning punya sertifikasi?",
                "Program di Infinite Learning cocok untuk siapa?",
                "Gimana sih metode belajar di Infinite Learning?",
                "Apakah Infinite Learning hanya untuk mahasiswa?"
            ],
            "responses": [
                "Infinite Learning, merupakan salah satu divisi dari PT Kinema Systrans multimedia (anak perusahaan dari Infinite Studios), berpusat pada pengembangan kursus pelatihan kejuruan yang relevan dengan kegiatan Infinite Studios dan permintaan yang terus meningkat akan bakat-bakat terampil di ekosistem Nongsa Digital Park. Dengan visi visi Menjadi penyedia solusi terdepan di bidang teknologi, penelitian dan pengembangan, serta inovasi melalui pelatihan dan pendidikan. Kami bertujuan untuk meningkatkan jumlah talenta digital yang kreatif dan inovatif, yang tidak hanya mandiri tetapi juga diakui oleh industri baik di Indonesia maupun dunia. Dan Misi Bekerja sama dengan semua lembaga pemerintah, lembaga penelitian nasional, serta institusi pendidikan/pelatihan baik di dalam maupun luar negeri untuk mengembangkan standar kurikulum, berkolaborasi dalam penelitian dan pengembangan, serta menyediakan pendanaan inovatif.",
                "Sebagai bagian dari Infinite Studios, Infinite Learning bertujuan untuk menjadi penyedia solusi terdepan dalam bidang teknologi, penelitian, dan pengembangan, dengan fokus pada pelatihan untuk mencetak talenta digital yang inovatif.",
                "Dengan visi untuk menjadi penyedia solusi terdepan di bidang teknologi dan inovasi, Infinite Learning berusaha menghasilkan talenta digital yang mandiri dan diakui industri di Indonesia maupun dunia.",
                "Infinite Learning berkomitmen untuk meningkatkan jumlah talenta digital yang kreatif dan inovatif melalui pelatihan yang relevan dengan permintaan industri di Nongsa Digital Park dan ekosistem teknologi global.",
                "Misi Infinite Learning adalah bekerja sama dengan lembaga pemerintah, institusi pendidikan, dan lembaga penelitian untuk mengembangkan standar kurikulum dan menyediakan pendanaan inovatif di bidang pelatihan dan pendidikan.",
                "Infinite Learning hadir untuk memenuhi permintaan yang terus berkembang akan bakat terampil dalam ekosistem Nongsa Digital Park dengan menyediakan pelatihan yang relevan dan berkualitas tinggi.",
                "Sebagai bagian dari PT Kinema Systrans Multimedia, Infinite Learning mendukung pengembangan sumber daya manusia di bidang teknologi melalui kursus pelatihan yang disesuaikan dengan kebutuhan industri dan perkembangan global.",
                "Dengan tujuan untuk menciptakan talenta digital yang diakui, Infinite Learning bekerja sama dengan berbagai lembaga nasional dan internasional untuk memajukan pendidikan dan inovasi teknologi.",
                "Infinite Learning berfokus pada pengembangan bakat-bakat terampil dalam teknologi, penelitian, dan pengembangan untuk menghasilkan individu-individu yang mampu berkontribusi di industri digital global.",
                "Misi utama Infinite Learning adalah untuk meningkatkan kualitas pendidikan dan pelatihan melalui kolaborasi dengan institusi pendidikan dan lembaga penelitian, guna menyediakan solusi inovatif dalam pengembangan talenta digital.",
                "Infinite Learning adalah divisi dari PT Kinema Systrans Multimedia yang berfokus pada pelatihan talenta digital di ekosistem Nongsa Digital Park.",
                "Kami menyediakan pelatihan vokasional yang sesuai kebutuhan industri digital, khususnya yang berkembang di Infinite Studios.",
                "Infinite Learning berkolaborasi dengan pemerintah, institusi pendidikan, dan lembaga riset untuk mengembangkan pendidikan berbasis industri.",
                "Visi kami adalah mencetak talenta digital yang inovatif dan siap bersaing di level global.",
                "Kami membantu peserta berkembang lewat kurikulum yang relevan dengan permintaan industri saat ini.",
                "Infinite Learning unggul dalam pengalaman industri langsung dan pengembangan kurikulum berbasis kebutuhan nyata di lapangan.",
                "Kami menyediakan pelatihan bersertifikat dengan materi terkini yang diakui di sektor digital.",
                "Program kami terbuka untuk mahasiswa, fresh graduate, maupun profesional muda yang ingin upskill.",
                "Pembelajaran kami berbasis proyek, kolaboratif, dan berorientasi pada tantangan nyata dunia kerja.",
                "Dengan semangat kolaborasi dan inovasi, Infinite Learning mencetak lulusan yang mandiri dan diakui industri."
            ]
        },
        {
            "tag": "studi_independen",
            "patterns": [
                "Jelaskan tentang program Studi Independen di Infinite Learning",
                "Apa saja program Studi Independen di Infinite Learning?",
                "Studi Independen di Infinite Learning ada program apa aja sih?",
                "Program Studi Independen apa saja yang ditawarkan oleh Infinite Learning?",
                "Apa yang bisa dipelajari dalam program Studi Independen di Infinite Learning?",
                "Bagaimana cara mengikuti program Studi Independen di Infinite Learning?",
                "Apa kelebihan mengikuti program Studi Independen di Infinite Learning?",
                "Apa saja bidang yang tersedia dalam program Studi Independen di Infinite Learning?",
                "Apa manfaat mengikuti program Studi Independen di Infinite Learning?",
                "Program Studi Independen apa yang paling populer di Infinite Learning?",
                "Apa itu program Studi Independen?",
                "Jelaskan tentang Studi Independen.",
                "Studi Independen itu apa sih?",
                "Bisa dijelaskan Studi Independen itu gimana?",
                "Saya ingin tahu apa itu Studi Independen.",
                "Studi Independen termasuk program apa?",
                "Apakah kamu tahu tentang Studi Independen?",
                "Gimana konsep Studi Independen?",
                "Studi Independen itu maksudnya apa?",
                "Program Studi Independen itu untuk apa?"
            ],
            "responses": [
                "Program Studi Independen adalah program pembelajaran intensif berdurasi satu semester (setara 20 SKS). Program ini didesain bersama praktisi industri dan menggunakan pendekatan project-based learning dengan 30% teori dan 70% praktik. Terdapat 5 Learning Path pada program Studi Independen di Infinite Learning, yaitu Android Mobile Development & UIUX Designer, Web Development & UIUX Design, Game Development, Linux System Administration, dan Artificial Intelegent",
                "Terdapat 5 Learning Path pada program Studi Independen di Infinite Learning, yaitu Android Mobile Development & UIUX Designer, Web Development & UIUX Design, Game Development, Linux System Administration, dan Artificial Intelegent. Pastikan kamu memilih learning path sesuai dengan minat kamu ya",
                "Program Studi Independen di Infinite Learning merupakan program pembelajaran satu semester yang difokuskan pada pengembangan keterampilan praktis. Program ini mengkombinasikan teori dan praktik dengan pendekatan project-based learning, dan mencakup 5 Learning Path: Android Mobile Development, Web Development, Game Development, Linux System Administration, dan Artificial Intelegent.",
                "Dalam program Studi Independen, peserta akan mengikuti pembelajaran berbasis proyek selama satu semester. Ada 5 Learning Path yang ditawarkan di Infinite Learning, yaitu Android Mobile Development, Web Development, Game Development, Linux System Administration, dan Artificial Intelegent.",
                "Program Studi Independen di Infinite Learning menawarkan pembelajaran intensif yang menggabungkan teori dan praktik, dengan 5 Learning Path yang bisa dipilih, termasuk Android Mobile Development, Web Development, Game Development, Linux System Administration, dan Artificial Intelegent.",
                "Di Infinite Learning, program Studi Independen dirancang untuk membantu peserta menguasai keterampilan praktis dalam berbagai bidang dengan durasi satu semester. Program ini mencakup 5 Learning Path, yaitu Android Mobile Development, Web Development, Game Development, Linux System Administration, dan Artificial Intelegent.",
                "Program Studi Independen di Infinite Learning difokuskan pada pengembangan keterampilan praktis dengan menggunakan metode pembelajaran berbasis proyek. Ada 5 Learning Path yang bisa dipilih, yaitu Android Mobile Development, Web Development, Game Development, Linux System Administration, dan Artificial Intelegent.",
                "Di dalam program Studi Independen, peserta akan mempelajari keterampilan praktis yang langsung dapat diterapkan di dunia industri. Program ini terdiri dari 5 Learning Path, yaitu Android Mobile Development, Web Development, Game Development, Linux System Administration, dan Artificial Intelegent.",
                "Program Studi Independen di Infinite Learning menggunakan pendekatan project-based learning dengan pembagian 30% teori dan 70% praktik. Ada 5 Learning Path yang dapat dipilih, yaitu Android Mobile Development, Web Development, Game Development, Linux System Administration, dan Artificial Intelegent.",
                "Tersedia 5 Learning Path di program Studi Independen Infinite Learning yang mencakup Android Mobile Development & UIUX Designer, Web Development & UIUX Design, Game Development, Linux System Administration, dan Artificial Intelegent. Setiap path dirancang untuk memberikan keterampilan praktis yang dibutuhkan industri.",
                "Studi Independen adalah program Kampus Merdeka yang memberikan kesempatan mahasiswa belajar langsung dari industri.",
                "Program ini memungkinkan kamu belajar secara praktikal di perusahaan mitra.",
                "Studi Independen memberikan pengalaman nyata yang tidak didapat dari kuliah biasa.",
                "Kamu akan dibimbing oleh mentor profesional dari industri selama beberapa bulan.",
                "Peserta Studi Independen bekerja dalam proyek yang merepresentasikan kebutuhan nyata di dunia kerja.",
                "Studi Independen menjadi jembatan antara teori di kampus dan praktik di industri.",
                "Program ini sangat cocok bagi mahasiswa yang ingin memperluas skill dan portofolio.",
                "Melalui Studi Independen, kamu bisa terhubung dengan praktisi dan jejaring profesional.",
                "Studi Independen berlangsung selama satu semester dan diakui sebagai bagian dari SKS.",
                "Ini adalah cara bagus untuk menjelajahi karier sebelum lulus kuliah."
            ]
        },
        {
            "tag": "program_benefits",
            "patterns": [
                "Apa keuntungan mengikuti Studi Independen di Infinite Learning?",
                "Manfaat apa yang didapat dari program Studi Independen?",
                "Benefit mengikuti Studi Independen di Infinite Learning apa aja sih?",
                "Mengapa saya harus mengikuti program Studi Independen?",
                "Apa saja keunggulan program Studi Independen ini?",
                "Apa manfaat utama dari Studi Independen?",
                "Keuntungan apa yang ditawarkan oleh Studi Independen?",
                "Apakah ada manfaat khusus dari program ini?",
                "Bagaimana program ini dapat meningkatkan karir saya?",
                "Apa nilai tambah dari mengikuti Studi Independen di sini?",
                "Apa keuntungan ikut program ini?",
                "Apa saja manfaat dari program ini?",
                "Program ini berguna untuk apa?",
                "Apa yang akan saya dapat dari ikut program?",
                "Program ini memberikan keuntungan apa?",
                "Apa saja hal positif dari program ini?",
                "Kenapa saya harus ikut program ini?",
                "Program ini bermanfaat dalam hal apa?",
                "Apa nilai tambah dari ikut program ini?",
                "Apa saja keunggulan ikut program ini?"
            ],
            "responses": [
                "Keuntungan mengikuti program ini termasuk konversi 20 SKS, 2 Sertifikat berupa Sertifikat Studi Independen dan Magang, portfolio project, dan networking.",
                "Manfaat program meliputi konversi hingga 20 SKS, kesempatan magang, bekerja di perusahaan multinasional, pembelajaran fleksibel, 2 sertifikat berupa Sertifikat Studi Independen dan Magang, serta membangun portofolio melalui proyek nyata yang dapat dipublikasikan",
                "Program ini menawarkan keuntungan seperti konversi 20 SKS, mendapatkan dua sertifikat (Sertifikat Studi Independen dan Magang), kesempatan magang di perusahaan ternama, serta membangun portfolio dengan proyek nyata yang bisa dipublikasikan.",
                "Dengan mengikuti program ini, peserta akan memperoleh konversi 20 SKS, dua sertifikat (Studi Independen dan Magang), kesempatan magang di perusahaan besar, dan portfolio yang dapat dipublikasikan.",
                "Keuntungan utama program ini adalah konversi 20 SKS, dua sertifikat (Studi Independen dan Magang), pengalaman magang di perusahaan multinasional, serta kesempatan untuk membangun portfolio yang kuat dengan proyek nyata.",
                "Manfaat dari mengikuti program ini mencakup konversi hingga 20 SKS, mendapatkan dua sertifikat, kesempatan untuk magang di perusahaan multinasional, serta pengalaman belajar yang fleksibel dengan proyek yang bisa dipublikasikan.",
                "Keikutsertaan dalam program ini memberi peserta konversi 20 SKS, dua sertifikat yang mengakui pencapaian di Studi Independen dan Magang, serta kesempatan untuk bekerja di perusahaan ternama dan membangun portfolio.",
                "Program ini memberi peserta keuntungan seperti konversi 20 SKS, dua sertifikat (Studi Independen dan Magang), pengalaman magang di perusahaan besar, serta kesempatan membangun portfolio melalui proyek nyata.",
                "Keuntungan mengikuti program Studi Independen adalah konversi 20 SKS, dua sertifikat, kesempatan magang di perusahaan besar, serta membangun portfolio yang relevan dengan industri.",
                "Dengan mengikuti program ini, peserta akan mendapatkan konversi 20 SKS, dua sertifikat (Sertifikat Studi Independen dan Magang), pengalaman magang di perusahaan multinasional, serta kesempatan untuk membangun portofolio yang dapat dipublikasikan.",
                "Kamu bisa memperluas koneksi dan relasi profesional di bidangmu.",
                "Program ini menambah pengalaman praktikal yang bernilai di dunia kerja.",
                "Kamu akan mendapatkan sertifikat resmi dari mitra industri.",
                "Ada kesempatan untuk direkrut langsung oleh perusahaan mitra.",
                "Kamu akan belajar teknologi dan tools yang digunakan secara nyata di industri.",
                "Program ini membangun soft skill seperti komunikasi, kolaborasi, dan leadership.",
                "Portofolio yang kamu bangun bisa digunakan untuk melamar kerja setelah lulus.",
                "Kamu bisa mengubah cara berpikir dari akademik ke industri.",
                "Program ini membuka wawasan karier dan bidang-bidang pekerjaan di masa depan.",
                "Banyak peserta merasakan peningkatan kepercayaan diri dan kompetensi setelah mengikuti program ini."
            ]
        },
        {
            "tag": "registration_process",
            "patterns": [
                "Bagaimana cara mendaftar program Studi Independen?",
                "Apa tahapan pendaftaran Studi Independen?",
                "Gimana sih cara daftarnya?",
                "Aku ingin ikut Studi Independen, apa yang perlu saya lakukan?",
                "Langkah apa saja yang diperlukan untuk mendaftar Studi Independen?",
                "Bagaimana proses pendaftaran Studi Independen dilakukan?",
                "Apa yang harus saya siapkan untuk mendaftar Studi Independen?",
                "Apakah pendaftaran Studi Independen bisa dilakukan secara online?",
                "Adakah panduan khusus untuk mendaftar Studi Independen?",
                "Apa yang perlu saya ketahui sebelum mendaftar Studi Independen?",
                "Kamu harus terdaftar sebagai mahasiswa aktif saat mendaftar.",
                "Biasanya program ini terbuka untuk mahasiswa minimal semester 5.",
                "Beberapa program meminta IPK minimal 2.75 atau 3.0.",
                "Kamu perlu menyiapkan CV dan surat rekomendasi (jika diminta).",
                "Pendaftaran dilakukan melalui platform Kampus Merdeka.",
                "Kamu wajib membuat akun dan melengkapi profilmu di platform.",
                "Pastikan tidak sedang mengambil program Kampus Merdeka lain di semester yang sama.",
                "Beberapa program meminta kemampuan dasar tertentu, seperti coding atau desain.",
                "Motivasi dan komitmen sangat penting dalam proses seleksi.",
                "Periksa syarat tiap mitra program karena bisa berbeda-beda."
            ],
            "responses": [
                "Jika kamu ingin mendaftar melalui program Kampus Merdeka, Silahkan Buka situs Kampus Merdeka, klik Program Studi Independen, cari \"Infinite Learning\" dan pilih program yang Kamu minati, kemudian unggah dokumen yang diperlukan di situs Kampus Merdeka, dan tunggu pengumuman final melalui email/WhatsApp. Jika ingin mendaftar melalui Kampus Merdeka Mandiri, kamu bisa mengunjungi link berikut : https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Untuk mendaftar melalui Kampus Merdeka, buka situs Kampus Merdeka, pilih Program Studi Independen, cari \"Infinite Learning\", pilih program yang kamu minati, unggah dokumen yang diperlukan, dan tunggu pengumuman final lewat email/WhatsApp. Jika mendaftar melalui Kampus Merdeka Mandiri, klik link ini: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Untuk mendaftar di program Kampus Merdeka, buka situs Kampus Merdeka, pilih Program Studi Independen, cari \"Infinite Learning\", pilih program yang diinginkan, unggah dokumen yang dibutuhkan, dan tunggu pengumuman final via email/WhatsApp. Untuk pendaftaran Kampus Merdeka Mandiri, kunjungi link berikut: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Jika ingin mendaftar melalui Kampus Merdeka, buka situs resmi Kampus Merdeka, pilih Program Studi Independen, cari \"Infinite Learning\", pilih program yang diminati, unggah dokumen yang diperlukan, dan nantikan pengumuman final melalui email/WhatsApp. Untuk pendaftaran Mandiri, cek link berikut: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Untuk mendaftar melalui program Kampus Merdeka, kunjungi situs Kampus Merdeka, klik Program Studi Independen, cari \"Infinite Learning\", pilih program yang diinginkan, unggah dokumen yang diperlukan, dan tunggu pengumuman final via email atau WhatsApp. Untuk pendaftaran mandiri, klik link ini: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Jika kamu ingin mendaftar melalui Kampus Merdeka, buka situs Kampus Merdeka, pilih Program Studi Independen, cari \"Infinite Learning\", pilih program yang sesuai, unggah dokumen yang dibutuhkan, dan tunggu pengumuman final lewat email atau WhatsApp. Jika ingin mendaftar mandiri, kunjungi link berikut: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Untuk pendaftaran Kampus Merdeka, buka situs Kampus Merdeka, pilih Program Studi Independen, cari \"Infinite Learning\", pilih program yang kamu inginkan, unggah dokumen yang dibutuhkan, dan nantikan pengumuman final melalui email atau WhatsApp. Jika pendaftaran mandiri, akses link berikut: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Buka situs Kampus Merdeka untuk mendaftar melalui Program Studi Independen, pilih \"Infinite Learning\", pilih program yang diminati, unggah dokumen yang diperlukan, dan tunggu pengumuman final via email atau WhatsApp. Jika mendaftar mandiri, gunakan link berikut: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Untuk mengikuti program Kampus Merdeka, buka situs Kampus Merdeka, klik Program Studi Independen, cari \"Infinite Learning\", pilih program yang diinginkan, unggah dokumen yang diperlukan, dan nantikan pengumuman final via email/WhatsApp. Jika melalui Kampus Merdeka Mandiri, kunjungi link ini: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Jika mendaftar melalui Kampus Merdeka, buka situs Kampus Merdeka, pilih Program Studi Independen, cari \"Infinite Learning\", pilih program yang diminati, unggah dokumen yang diperlukan, dan tunggu pengumuman final lewat email/WhatsApp. Untuk pendaftaran mandiri, klik link berikut: https://course.infinitelearning.id/course-category/kamdek-mandiri/",
                "Kamu harus terdaftar sebagai mahasiswa aktif saat mendaftar.",
                "Biasanya program ini terbuka untuk mahasiswa minimal semester 5.",
                "Beberapa program meminta IPK minimal 2.75 atau 3.0.",
                "Kamu perlu menyiapkan CV dan surat rekomendasi (jika diminta).",
                "Pendaftaran dilakukan melalui platform Kampus Merdeka.",
                "Kamu wajib membuat akun dan melengkapi profilmu di platform.",
                "Pastikan tidak sedang mengambil program Kampus Merdeka lain di semester yang sama.",
                "Beberapa program meminta kemampuan dasar tertentu, seperti coding atau desain.",
                "Motivasi dan komitmen sangat penting dalam proses seleksi.",
                "Periksa syarat tiap mitra program karena bisa berbeda-beda."
            ]
        },
        {
            "tag": "learning_schedule",
            "patterns": [
                "Bagaimana jadwal belajar di Studi Independen?",
                "Kapan sesi belajar diadakan?",
                "Apakah jadwal belajar di Studi Independen fleksibel?",
                "Apa saja kegiatan dalam jadwal pembelajaran?",
                "Berapa jam sehari sesi pembelajaran berlangsung?",
                "Kapan waktu untuk pembelajaran diadakan?",
                "Berapa lama durasi program Studi Independen setiap hari?",
                "Bagaimana sesi pembelajaran dilakukan?",
                "Apa saja fasilitas yang didapat dalam program ini?",
                "Fasilitas apa yang tersedia selama program?",
                "Apa saya akan dapat laptop atau tools lainnya?",
                "Apakah ada akses ke software profesional?",
                "Fasilitas apa saja yang disediakan untuk peserta?",
                "Apakah dapat bimbingan mentor di program ini?",
                "Apa saya akan dapat modul atau materi belajar?",
                "Apakah semua peserta dapat sertifikat?",
                "Apakah program ini memberikan uang saku?",
                "Fasilitas pendukung apa saja yang bisa saya gunakan?"
            ],
            "responses": [
                "Pembelajaran akan berlangsung Senin-Jumat, Sesi online dibagi menjadi 2 sesi yaitu pada pukul 09.00-12.00 WIB dan pada pukul 14.00-17.00 WIB. Pada hari Senin-Kamis pembelajaran terdiri dari Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Dan di hari Jumat diadakan Culture Week dan English Day.",
                "Program pembelajaran dilakukan dari Senin hingga Jumat, dengan dua sesi online yang dimulai pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Pada Senin hingga Kamis, kegiatan meliputi Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Hari Jumat dikhususkan untuk Culture Week dan English Day.",
                "Jadwal pembelajaran adalah Senin sampai Jumat, dengan dua sesi online yaitu pukul 09.00-12.00 WIB dan pukul 14.00-17.00 WIB. Pada hari Senin-Kamis, peserta akan mengikuti Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Di hari Jumat, ada Culture Week dan English Day.",
                "Pembelajaran dilaksanakan dari Senin hingga Jumat dengan sesi online pada pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Pada hari Senin hingga Kamis, materi yang diajarkan mencakup Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Hari Jumat untuk Culture Week dan English Day.",
                "Kegiatan pembelajaran berlangsung Senin-Jumat, dengan dua sesi online yaitu pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Pada Senin hingga Kamis, peserta akan mengikuti Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Di hari Jumat, ada kegiatan Culture Week dan English Day.",
                "Jadwal pembelajaran program ini adalah Senin sampai Jumat, dengan sesi online dibagi menjadi dua, pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Senin hingga Kamis terdiri dari Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Pada hari Jumat, kegiatan dilanjutkan dengan Culture Week dan English Day.",
                "Pembelajaran program ini dilaksanakan Senin sampai Jumat dengan dua sesi online: pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Pada hari Senin hingga Kamis, peserta mengikuti Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Hari Jumat khusus untuk Culture Week dan English Day.",
                "Program pembelajaran berlangsung dari Senin hingga Jumat, dengan dua sesi online yaitu pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Senin sampai Kamis diisi dengan Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Pada hari Jumat, peserta akan mengikuti Culture Week dan English Day.",
                "Pembelajaran dilaksanakan setiap Senin sampai Jumat, dengan dua sesi online: pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Pada hari Senin hingga Kamis, kegiatan meliputi Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Di hari Jumat, ada kegiatan Culture Week dan English Day.",
                "Setiap minggu, pembelajaran berlangsung Senin hingga Jumat, dengan sesi online yang dibagi menjadi dua: pukul 09.00-12.00 WIB dan 14.00-17.00 WIB. Pada Senin hingga Kamis, peserta akan mengikuti Soft Skill & Hard Skill session, hands-on practice, mentoring, dan project work. Hari Jumat dikhususkan untuk Culture Week dan English Day.",
                "Kamu akan mendapatkan akses ke tools dan software profesional yang digunakan industri.",
                "Peserta akan mendapatkan mentoring rutin dari praktisi berpengalaman.",
                "Modul dan materi pembelajaran akan diberikan selama program berlangsung.",
                "Beberapa program menyediakan uang saku atau insentif bagi peserta aktif.",
                "Kamu bisa mengakses LMS untuk belajar secara mandiri.",
                "Ada sesi konsultasi karier dan pengembangan diri selama program.",
                "Kamu akan mendapat kesempatan ikut seminar dan workshop eksklusif.",
                "Fasilitas project showcase akan membantumu memamerkan hasil kerja.",
                "Kamu juga akan mendapat sertifikat kelulusan dari mitra program.",
                "Beberapa program memberi fasilitas tambahan seperti akses workspace atau laptop (jika diperlukan)."
            ]
        },
        {
            "tag": "web_curriculum",
            "patterns": [
                "Apa saja kurikulum Web Development?",
                "Materi apa saja yang dipelajari di kelas Web Development?",
                "Apa saja topik yang dibahas di program pelatihan Web Development?",
                "Apa saja skill yang bisa didapatkan setelah mengikuti kelas Web Development?",
                "Bagaimana struktur kurikulum Web Development di program ini?",
                "Apa saja materi inti yang diajarkan dalam kelas Web Development?",
                "Seperti apa pembagian materi di kelas Web Development?",
                "Apa saja teknik yang dipelajari dalam kursus Web Development?",
                "Apa yang akan dipelajari oleh peserta yang mengikuti program Web Development ini?",
                "Bagaimana rincian materi yang diajarkan dalam pelatihan Web Development?",
                "Kurikulum apa yang ditawarkan dalam program Web Development?",
                "Apa saja pelajaran utama dalam Web Development?",
                "Program Web Development membahas topik apa saja?",
                "Hal apa saja yang diajarkan dalam kelas Web Development?",
                "Apa keterampilan utama yang dikembangkan dalam program Web Development?",
                "Apa isi materi dalam program Web Development ini?",
                "Web Development mengajarkan apa saja?",
                "Bagian apa saja yang ada dalam kurikulum Web Development?",
                "Topik apa saja yang dibahas selama kelas Web Development?",
                "Materi apa yang menjadi fokus dalam pelatihan Web Development?"
            ],
            "responses": [
                "Kurikulum Web Development mencakup pembelajaran Hard Skill dan Soft Skill. Pada Hard Skill akan mempelajari Product Research, User Interface (UI) Design, Pengenalan Front End Development, Pengenalan Back End Development, Cloud Computing dan Cyber Security. Sedangkan untuk Soft Skill, terdapat Keterampilan Profesional Colaboratif, Communication, dan Adaptation, Project Management, dan Career Coaching",
                "Di kelas Web Development, peserta akan mempelajari kombinasi Hard Skill seperti Product Research, UI Design, serta Front End dan Back End Development, serta Soft Skill yang meliputi keterampilan komunikasi, kolaborasi, adaptasi, manajemen proyek, dan persiapan karir.",
                "Kurikulum Web Development terbagi dalam dua area utama, yaitu Hard Skill yang mencakup pengenalan Front End dan Back End Development, UI Design, Cloud Computing, dan Cyber Security, serta Soft Skill yang fokus pada pengembangan keterampilan profesional, komunikasi, kolaborasi, adaptasi, manajemen proyek, dan persiapan karir.",
                "Pada kursus Web Development, Anda akan mempelajari materi Hard Skill seperti Product Research, UI Design, dan pengembangan Front End serta Back End, serta Soft Skill seperti kolaborasi, komunikasi, adaptasi, manajemen proyek, dan coaching karir.",
                "Program Web Development mengajarkan berbagai Hard Skill yang meliputi Front End Development, Back End Development, UI Design, Cloud Computing, dan Cyber Security, serta Soft Skill untuk mengasah keterampilan profesional, komunikasi, kolaborasi, adaptasi, manajemen proyek, dan kesiapan karir.",
                "Kurikulum Web Development menawarkan kombinasi pembelajaran Hard Skill dalam bidang Front End dan Back End Development, UI Design, serta Cyber Security, dengan penekanan pada Soft Skill seperti manajemen proyek, komunikasi, kolaborasi, adaptasi, dan coaching karir.",
                "Dalam kelas Web Development, peserta mempelajari berbagai keterampilan teknis seperti Product Research, UI Design, dan pengembangan Front End dan Back End, serta keterampilan Soft Skill yang mencakup komunikasi, kolaborasi, adaptasi, manajemen proyek, dan pengembangan karir.",
                "Program pelatihan Web Development meliputi Hard Skill dalam bidang Front End dan Back End Development, UI Design, Cloud Computing, dan Cyber Security, serta Soft Skill untuk membangun keterampilan dalam komunikasi, kolaborasi, adaptasi, manajemen proyek, dan coaching karir.",
                "Kurikulum Web Development berfokus pada penguasaan Hard Skill seperti Product Research, Front End dan Back End Development, UI Design, serta Cloud Computing dan Cyber Security. Di samping itu, peserta juga akan mengembangkan Soft Skill dalam komunikasi, kolaborasi, adaptasi, manajemen proyek, dan persiapan karir.",
                "Di program Web Development, peserta akan mempelajari materi Hard Skill yang meliputi UI Design, Front End dan Back End Development, serta Cloud Computing dan Cyber Security, serta Soft Skill yang akan membantu meningkatkan kemampuan komunikasi, kolaborasi, adaptasi, manajemen proyek, dan coaching karir.",
                "Pelatihan Web Development membekali peserta dengan kemampuan teknis seperti pengembangan antarmuka pengguna dan arsitektur backend serta keterampilan profesional yang relevan di dunia kerja.",
                "Materi dalam Web Development terdiri dari pengenalan pemrograman sisi klien dan server, desain UI, serta penggunaan layanan cloud dan keamanan digital.",
                "Program ini juga mengajarkan bagaimana mengelola proyek secara kolaboratif dan efektif menggunakan prinsip Agile serta kemampuan beradaptasi di dunia kerja digital.",
                "Selain keterampilan teknis, peserta juga akan memahami bagaimana menyampaikan ide dengan baik dan membangun citra profesional dalam dunia teknologi.",
                "Web Development mengintegrasikan pemahaman desain produk dengan implementasi teknologi front-end dan back-end modern.",
                "Kurikulum ini mempersiapkan peserta untuk memahami siklus hidup pengembangan web dari riset produk hingga pengujian dan peluncuran.",
                "Fokus pembelajaran juga mencakup penerapan praktik keamanan dasar dalam pengembangan aplikasi web.",
                "Peserta akan mempelajari alur kerja pengembangan web secara kolaboratif dalam tim lintas disiplin.",
                "Materi UI Design dan Cloud Computing menjadi penunjang utama dalam membangun aplikasi web yang skalabel dan user-friendly.",
                "Pembelajaran Soft Skill dirancang agar peserta mampu menghadapi tantangan industri melalui komunikasi yang efektif dan adaptasi terhadap perubahan."
            ]
        },
        {
            "tag": "web_requirements",
            "patterns": [
                "Apa syarat mengikuti Studi Independen program Web Development?",
                "Apa saja kriteria untuk bergabung dalam program Web Development?",
                "Siapa yang dapat mendaftar program Studi Independen Web Development?",
                "Apa persyaratan untuk masuk program Web Development?",
                "Apakah ada syarat tertentu untuk mengikuti program Web Development?",
                "Siapa saja yang memenuhi kualifikasi untuk Studi Independen Web Development?",
                "Apa saja yang diperlukan untuk mendaftar program Web Development?",
                "Persyaratan apa yang harus dipenuhi untuk mengikuti program Web Development?",
                "Apa saja syarat teknis untuk program Web Development?",
                "Apakah saya memenuhi syarat untuk Studi Independen Web Development?",
                "Apa saja syarat untuk belajar web development?",
                "Saya butuh apa saja untuk mulai belajar web?",
                "Apa kualifikasi minimal untuk masuk web development?",
                "Apakah saya harus bisa HTML dulu?",
                "Kalau belum pernah ngoding, boleh ikut track web?",
                "Apakah harus menguasai JavaScript sebelum belajar web?",
                "Syarat mengikuti kelas web apa aja?",
                "Saya harus tahu front-end dulu ya?",
                "Kalau background non-IT bisa ikut track web?",
                "Apa tools yang perlu disiapkan untuk web development?"
            ],
            "responses": [
                "Mahasiswa aktif minimal semester 4 untuk Program S1 atau semester 2 untuk Program D3/D4 dari semua jurusan (diutamakan jurusan IT, Desain Komunikasi Visual, dan Manajemen Bisnis), merupakan Warga Negara Indonesia yang sehat jasmani dan rohani, serta memiliki peralatan pendukung seperti laptop dengan spesifikasi minimum: OS 64-bit (Windows 8/10, MacOS 10.14 atau lebih tinggi, atau distribusi Linux 64-bit), prosesor x86_64 (Intel Core generasi ke-2 atau lebih baru atau AMD dengan dukungan virtualisasi), RAM 8 GB, dan penyimpanan minimal 8 GB (disarankan SSD).",
                "Peserta harus merupakan mahasiswa aktif minimal semester 4 untuk S1 atau semester 2 untuk D3/D4, dari semua jurusan (jurusan IT, Desain Komunikasi Visual, dan Manajemen Bisnis lebih diutamakan), sehat jasmani dan rohani, serta memiliki laptop dengan spesifikasi minimum seperti OS 64-bit, RAM 8 GB, dan penyimpanan 8 GB.",
                "Syarat utama untuk program Web Development adalah mahasiswa aktif minimal semester 4 (S1) atau semester 2 (D3/D4), Warga Negara Indonesia, sehat jasmani dan rohani, serta memiliki perangkat laptop dengan spesifikasi tertentu.",
                "Untuk mendaftar program Web Development, mahasiswa harus aktif pada semester 4 ke atas (S1) atau semester 2 ke atas (D3/D4), memiliki kesehatan yang baik, serta perangkat pendukung seperti laptop dengan OS 64-bit dan RAM 8 GB.",
                "Program ini memerlukan mahasiswa aktif dari semua jurusan (dengan prioritas jurusan IT, Desain Komunikasi Visual, dan Manajemen Bisnis), yang memiliki kesehatan jasmani dan rohani yang baik, serta laptop dengan spesifikasi minimum tertentu.",
                "Persyaratan program Web Development mencakup mahasiswa aktif minimal semester 4 (S1) atau semester 2 (D3/D4), WNI, sehat jasmani dan rohani, serta perangkat pendukung seperti laptop dengan prosesor Intel Core generasi ke-2 atau lebih baru.",
                "Peserta harus mahasiswa aktif dari semua jurusan, dengan prioritas pada jurusan teknologi informasi atau desain, dan memiliki laptop dengan RAM minimal 8 GB dan penyimpanan minimal 8 GB (disarankan SSD).",
                "Program Web Development mengharuskan mahasiswa aktif yang sehat secara jasmani dan rohani, dengan perangkat laptop ber-OS 64-bit dan prosesor x86_64 generasi terbaru.",
                "Untuk memenuhi syarat, mahasiswa perlu memiliki laptop dengan spesifikasi minimum (OS Windows 8/10 atau MacOS 10.14, RAM 8 GB, penyimpanan 8 GB), serta status aktif di perguruan tinggi.",
                "Mahasiswa aktif yang memenuhi kualifikasi ini juga harus memiliki perangkat Android untuk mendukung kegiatan belajar mengajar program Web Development.",
                "Untuk mengikuti track Web Development, disarankan memahami dasar HTML, CSS, dan JavaScript.",
                "Track Web dapat diikuti siapa saja, namun lebih baik jika kamu memiliki logika pemrograman dasar.",
                "Kamu tidak wajib mahir, tapi pemahaman dasar HTML dan CSS akan sangat membantu.",
                "Track ini cocok untuk pemula yang ingin mendalami dunia website.",
                "Kamu bisa mulai meskipun belum punya pengalaman kerja di bidang IT.",
                "Pastikan kamu punya semangat belajar dan komitmen ya!",
                "Kami menyarankan kamu mencoba latihan dasar di platform seperti freeCodeCamp.",
                "Tidak ada syarat formal, tapi kemampuan logika dasar sangat membantu.",
                "Boleh banget dari jurusan non-IT, yang penting mau belajar dan eksplorasi.",
                "Kamu butuh laptop, koneksi internet, dan semangat pantang menyerah!"
            ]
        },
        {
            "tag": "mobile_development_curriculum",
            "patterns": [
                "Apa saja kurikulum Mobile Development?",
                "Materi apa saja yang dipelajari di kelas Mobile Development?",
                "Apa saja yang diajarkan dalam kelas Mobile Development?",
                "Kelas Mobile Development mencakup pembelajaran apa saja?",
                "Apa yang dipelajari dalam program Mobile Development?",
                "Materi apa yang termasuk dalam kurikulum Mobile Development?",
                "Pelajaran apa yang akan didapatkan di kelas Mobile Development?",
                "Apa kurikulum utama untuk program Mobile Development?",
                "Kurikulum Mobile Development berisi topik apa saja?",
                "Mobile Development mempelajari apa saja?",
                "Apa isi kurikulum untuk mobile development?",
                "Apa aja yang diajarkan di track mobile?",
                "Saya akan belajar apa saja di mobile track?",
                "Apakah kurikulumnya pakai Kotlin atau Java?",
                "Mobile development ngajarin Flutter gak?",
                "Kurikulum mobile itu full Android atau ada iOS juga?",
                "Apakah akan belajar membuat aplikasi dari nol?",
                "Berapa lama belajar mobile di program ini?",
                "Apakah ada project akhir di mobile track?",
                "Materi mobile-nya update dengan tren terbaru gak?"
            ],
            "responses": [
                "Kurikulum Mobile Development mencakup pembelajaran Hard Skill dan Soft Skill. Pada Hard Skill akan mempelajari Product Research, User Interface (UI) Design, Pemrograman Kotlin, Pemrograman Android, Advance Android Features, Cloud Computing dan Cyber Security. Sedangkan untuk Soft Skill, terdapat Keterampilan Profesional Colaboratif, Communication, dan Adaptation, Project Management, dan Career Coaching",
                "Program Mobile Development mencakup Hard Skill seperti Product Research, UI Design, Pemrograman Kotlin, Pemrograman Android, Advance Android Features, serta Cloud Computing dan Cyber Security. Soft Skill yang diajarkan meliputi kolaborasi, komunikasi, adaptasi, manajemen proyek, dan persiapan karier.",
                "Materi dalam kurikulum Mobile Development meliputi Product Research, UI Design, Pemrograman Kotlin dan Android, Advance Android Features, serta fundamental Cloud Computing dan Cyber Security. Untuk Soft Skill, ada pengembangan komunikasi, kolaborasi, dan manajemen proyek.",
                "Dalam kurikulum Mobile Development, peserta akan mempelajari Product Research, User Interface (UI) Design, Kotlin Programming, Android Programming, Advance Android Features, Cloud Computing, dan Cyber Security. Soft Skill yang diajarkan mencakup keterampilan kolaborasi, komunikasi, adaptasi, serta manajemen proyek.",
                "Kurikulum ini menawarkan pembelajaran Hard Skill seperti Product Research, UI Design, Kotlin Programming, Pemrograman Android, Advance Android Features, Cloud Computing, dan Cyber Security. Sementara itu, Soft Skill mencakup kolaborasi, komunikasi, adaptasi, manajemen proyek, dan coaching karier.",
                "Peserta Mobile Development akan belajar Product Research, UI Design, Pemrograman Kotlin, Pemrograman Android tingkat lanjut, serta Cloud Computing dan Cyber Security. Soft Skill yang diajarkan meliputi pengembangan keterampilan kolaborasi, komunikasi, adaptasi, dan manajemen proyek.",
                "Mobile Development mengajarkan Hard Skill seperti Product Research, UI Design, Kotlin Programming, Pemrograman Android, Advanced Android Features, serta dasar-dasar Cloud Computing dan Cyber Security. Untuk Soft Skill, peserta akan mempelajari manajemen proyek dan coaching karier.",
                "Materi Mobile Development mencakup pembelajaran tentang Product Research, UI Design, Kotlin Programming, Android Development, Advanced Android Features, serta Cloud Computing dan Cyber Security. Soft Skill yang dilatih adalah keterampilan kolaborasi, adaptasi, dan komunikasi.",
                "Kurikulum Mobile Development fokus pada Hard Skill seperti Product Research, UI Design, Pemrograman Kotlin dan Android, fitur Android tingkat lanjut, serta Cloud Computing dan Cyber Security. Soft Skill meliputi keterampilan profesional dalam kolaborasi, komunikasi, dan adaptasi.",
                "Program ini mengajarkan Product Research, UI Design, Pemrograman Kotlin, Android Development, Advance Android Features, Cloud Computing, dan Cyber Security. Selain itu, peserta juga dilatih Soft Skill seperti kolaborasi, komunikasi, adaptasi, dan manajemen proyek.",
                "Kurikulum Mobile Development mencakup dasar Android dengan Kotlin, UI/UX, dan backend integration.",
                "Kamu akan belajar membuat aplikasi Android dari nol hingga deploy ke Play Store.",
                "Track ini fokus pada Android Native menggunakan Kotlin.",
                "Di akhir program, kamu akan membuat capstone project berupa aplikasi nyata.",
                "Kamu juga belajar penggunaan API, Firebase, dan arsitektur MVVM.",
                "Materinya dirancang langsung oleh praktisi industri dan update dengan kebutuhan pasar.",
                "Selain teknis, kamu juga akan diasah kemampuan soft skills dan kerja tim.",
                "Program ini berlangsung selama 16 minggu dengan sesi intensif.",
                "Kamu juga akan diberi simulasi kerja tim seperti di startup nyata.",
                "Tidak hanya coding, kamu juga belajar debugging, testing, dan optimasi performa."
            ]
        },
        {
            "tag": "mobile_development_requirements",
            "patterns": [
                "Apa syarat mengikuti Studi Independen program Mobile Development?",
                "Apa kriteria untuk bergabung dalam program Mobile Development?",
                "Siapa yang dapat mendaftar program Studi Independen Mobile Development?",
                "Apa persyaratan untuk masuk program Mobile Development?",
                "Apakah ada syarat tertentu untuk mengikuti program Mobile Development?",
                "Siapa saja yang memenuhi kualifikasi untuk Studi Independen Mobile Development?",
                "Apa saja yang diperlukan untuk mendaftar program Mobile Development?",
                "Persyaratan apa yang harus dipenuhi untuk mengikuti program Mobile Development?",
                "Apa saja syarat teknis untuk program Mobile Development?",
                "Apakah saya memenuhi syarat untuk Studi Independen Mobile Development?",
                "Syarat ikut track Mobile Development apa aja?",
                "Harus bisa Kotlin dulu ya?",
                "Kalau belum pernah ngoding, bisa ikut mobile?",
                "Apa tools yang perlu disiapkan untuk track mobile?",
                "Saya pakai laptop spek rendah, bisa ikut track mobile?",
                "Kalau belum tahu Android Studio, boleh daftar?",
                "Apakah harus punya pengalaman bikin aplikasi sebelumnya?",
                "Track ini cocok untuk pemula atau yang udah expert?",
                "Apakah iPhone bisa digunakan untuk track mobile?",
                "Apakah harus tahu dasar Java juga?"
            ],
            "responses": [
                "Mahasiswa aktif minimal semester 4 untuk Program S1 atau semester 2 untuk Program D3/D4 dari semua jurusan (diutamakan jurusan IT, Desain Komunikasi Visual, dan Manajemen Bisnis), merupakan Warga Negara Indonesia yang sehat jasmani dan rohani, memiliki smartphone berbasis Android, serta dilengkapi peralatan pendukung seperti laptop dengan spesifikasi minimum: OS 64-bit (Windows 8/10, MacOS 10.14 ke atas, atau distribusi Linux 64-bit), prosesor arsitektur x86_64 (Intel Core generasi ke-2 atau lebih baru, atau AMD dengan dukungan virtualisasi), RAM 8 GB (16 GB direkomendasikan), dan penyimpanan minimal 12 GB (SSD direkomendasikan).",
                "Peserta harus merupakan mahasiswa aktif S1 semester 4 atau lebih tinggi, atau mahasiswa D3/D4 minimal semester 2, dari semua jurusan (diutamakan jurusan IT, Desain Komunikasi Visual, dan Manajemen Bisnis), serta memenuhi kriteria seperti Warga Negara Indonesia, sehat jasmani dan rohani, memiliki smartphone Android, dan laptop dengan spesifikasi tertentu.",
                "Syarat program Mobile Development mencakup status mahasiswa aktif (S1 minimal semester 4 atau D3/D4 minimal semester 2), Warga Negara Indonesia, sehat jasmani dan rohani, memiliki smartphone Android, dan laptop dengan spesifikasi minimum yang memenuhi kebutuhan program.",
                "Untuk mengikuti program ini, mahasiswa harus aktif minimal semester 4 untuk S1 atau semester 2 untuk D3/D4, berasal dari semua jurusan (jurusan IT, Desain Komunikasi Visual, dan Manajemen Bisnis lebih diutamakan), memiliki kesehatan fisik dan mental yang baik, smartphone Android, serta laptop dengan spesifikasi tertentu.",
                "Persyaratan utama mencakup status mahasiswa aktif (S1 semester 4 ke atas atau D3/D4 minimal semester 2), WNI, sehat jasmani dan rohani, memiliki perangkat Android, serta laptop dengan OS 64-bit, prosesor minimal Intel Core generasi ke-2 atau setara, RAM 8 GB (disarankan 16 GB), dan penyimpanan 12 GB atau lebih (direkomendasikan SSD).",
                "Untuk mendaftar, peserta harus mahasiswa aktif S1 semester 4 atau lebih tinggi, atau D3/D4 minimal semester 2, dengan jurusan apa saja (diutamakan IT, Desain Komunikasi Visual, atau Manajemen Bisnis). Selain itu, peserta harus memiliki kesehatan yang baik, smartphone Android, dan laptop sesuai spesifikasi teknis program.",
                "Program ini membutuhkan peserta yang merupakan mahasiswa aktif (S1 minimal semester 4 atau D3/D4 minimal semester 2), WNI, sehat jasmani dan rohani, memiliki smartphone Android, serta laptop dengan spesifikasi yang mendukung kebutuhan pembelajaran.",
                "Syarat utama untuk mengikuti Studi Independen Mobile Development meliputi status mahasiswa aktif (S1 semester 4 atau lebih tinggi, D3/D4 minimal semester 2), WNI, sehat jasmani dan rohani, serta memiliki perangkat seperti smartphone Android dan laptop dengan spesifikasi tertentu.",
                "Peserta program harus mahasiswa aktif dengan minimal semester 4 untuk S1 atau semester 2 untuk D3/D4, WNI yang sehat jasmani dan rohani, memiliki perangkat Android, dan laptop dengan OS 64-bit, RAM 8 GB (direkomendasikan 16 GB), serta penyimpanan minimal 12 GB.",
                "Mahasiswa dari semua jurusan dapat mendaftar, dengan prioritas pada IT, Desain Komunikasi Visual, dan Manajemen Bisnis. Selain itu, peserta harus memenuhi syarat kesehatan, memiliki perangkat Android, dan laptop dengan spesifikasi teknis tertentu yang mendukung pembelajaran.",
                "Untuk track Mobile, disarankan familiar dengan dasar pemrograman.",
                "Tidak wajib bisa Kotlin dulu, tapi logika pemrograman penting.",
                "Kalau belum pernah ngoding, disarankan belajar logika dasar dulu.",
                "Kamu perlu laptop dengan spesifikasi cukup untuk menjalankan Android Studio.",
                "Android Studio cukup berat, pastikan RAM minimal 8GB jika memungkinkan.",
                "Tidak harus expert, track ini cocok juga untuk kamu yang ingin belajar dari awal.",
                "Jika kamu punya semangat dan mau belajar, kamu bisa ikut!",
                "Tools utama yang digunakan adalah Android Studio dan emulator Android.",
                "Kamu tidak wajib tahu Java, karena fokus utama di Kotlin.",
                "Program ini cocok untuk mahasiswa yang ingin masuk ke dunia mobile app."
            ]
        },
        {
            "tag": "micro",
            "patterns": [
                "Apa itu Micro Problem Project?",
                "Apa yang dimaksud dengan Micro Problem Project?",
                "Micro Problem Project itu apa ya?",
                "Apa tujuan dari Micro Problem Project?",
                "Apa yang dilakukan dalam Micro Problem Project?",
                "Bagaimana cara mengikuti Micro Problem Project?",
                "Apa saja yang dinilai dalam Micro Problem Project?",
                "Apa perbedaan Micro Problem Project dengan Massive Problem Project?",
                "Kenapa Micro Problem Project penting dalam pembelajaran?",
                "Apa saja tahap-tahap dalam Micro Problem Project?",
                "Apa saja langkah dalam Micro Problem Project?",
                "Mengapa Micro Problem Project penting untuk peserta?",
                "Apa yang harus saya lakukan saat mengikuti Micro Problem Project?",
                "Bagaimana cara menyelesaikan Micro Problem Project dengan baik?",
                "Apa hasil akhir dari Micro Problem Project?",
                "Siapa yang membimbing dalam Micro Problem Project?",
                "Apa bedanya Micro Problem Project dengan proyek lain?",
                "Apa kerangka kerja yang digunakan dalam Micro Problem Project?",
                "Berapa lama durasi Micro Problem Project?",
                "Bagaimana cara bergabung dalam Micro Problem Project?"
            ],
            "responses": [
                "Micro Problem Project adalah tantangan berskala kecil selama 6 minggu yang bertujuan menghasilkan High Fidelity Prototype, dengan bimbingan mentor grup dan mentor personal, menggunakan kerangka kerja design thinking yang meliputi tahap research, problem, idea, prototype, dan test.",
                "Micro Problem Project merupakan proses pembelajaran berbasis tantangan yang dirancang untuk melatih kemampuan peserta dalam membuat High Fidelity Prototype dalam waktu 6 minggu.",
                "Dalam Micro Problem Project, peserta akan belajar menggunakan kerangka kerja design thinking secara bertahap, mulai dari research hingga testing, untuk menghasilkan solusi inovatif.",
                "Micro Problem Project adalah proyek mini yang menekankan pada kolaborasi tim dan penerapan metode design thinking untuk menciptakan High Fidelity Prototype.",
                "Melalui Micro Problem Project, peserta akan mendapatkan pengalaman langsung dalam riset pengguna, menemukan permasalahan, menghasilkan ide, membuat prototipe, dan mengujinya.",
                "Tujuan dari Micro Problem Project adalah untuk melatih peserta dalam menyusun solusi desain yang relevan dan mendalam melalui pendekatan design thinking.",
                "Micro Problem Project memberikan kesempatan kepada peserta untuk mempraktikkan keterampilan desain mereka dalam proyek nyata dengan bimbingan mentor.",
                "Micro Problem Project adalah bagian dari program yang berfokus pada pengembangan prototipe berkualitas tinggi melalui metode kolaboratif selama 6 minggu.",
                "Peserta Micro Problem Project akan mengasah kemampuan mereka dalam memahami kebutuhan pengguna dan menciptakan solusi inovatif yang dituangkan dalam High Fidelity Prototype.",
                "Micro Problem Project dirancang untuk memberikan pengalaman praktik yang terstruktur dalam pembuatan prototipe desain, melibatkan mentor personal, dan menggunakan pendekatan design thinking.",
                "Micro Problem Project adalah proyek 6 minggu untuk membuat prototipe berkualitas tinggi menggunakan metode design thinking dan bimbingan mentor.",
                "Peserta akan belajar riset, identifikasi masalah, ideasi, pembuatan prototipe, dan pengujian solusi dalam proyek ini.",
                "Proyek ini penting untuk mengasah kemampuan praktis peserta dalam menciptakan solusi desain yang inovatif dan terukur.",
                "Dalam Micro Problem Project, kamu akan mendapatkan pendampingan intensif dari mentor untuk menghasilkan prototipe yang siap diuji.",
                "Hasil dari Micro Problem Project berupa High Fidelity Prototype yang siap diuji dan dikembangkan lebih lanjut.",
                "Micro Problem Project didukung mentor personal dan grup yang membimbing tiap tahapan sesuai framework design thinking.",
                "Proyek ini berskala kecil tapi sangat fokus pada kualitas prototipe dan proses design thinking.",
                "Framework design thinking menjadi landasan utama dalam pelaksanaan Micro Problem Project mulai dari research hingga test.",
                "Micro Problem Project biasanya berlangsung selama 6 minggu dengan target prototipe fungsional.",
                "Peserta bisa mengikuti Micro Problem Project sebagai bagian dari program yang menawarkan tantangan nyata untuk pengembangan skill desain."
            ]
        },
        {
            "tag": "massive",
            "patterns": [
                "Apa yang dimaksud Massive Problem Project?",
                "Apa itu Massive Problem Project?",
                "Massive Problem Project itu apa ya?",
                "Apa yang dipelajari pada Massive Problem Project?",
                "Apa tujuan dari Massive Problem Project?",
                "Apa saja tahapan pada Massive Problem Project?",
                "Bagaimana proses Massive Problem Project berlangsung?",
                "Berapa lama durasi Massive Problem Project?",
                "Siapa yang membimbing dalam Massive Problem Project?",
                "Apa hasil yang diharapkan dari Massive Problem Project?",
                "Apa saja yang dikerjakan di Massive Problem Project?",
                "Berapa lama Massive Problem Project berlangsung?",
                "Bagaimana cara kerja tim di Massive Problem Project?",
                "Apa hasil utama Massive Problem Project?",
                "Bagaimana metode SCRUM diterapkan dalam Massive Problem Project?",
                "Apa keuntungan mengikuti Massive Problem Project?",
                "Siapa saja yang terlibat dalam Massive Problem Project?",
                "Apa saja tahapan dalam proyek Massive Problem?",
                "Bagaimana kolaborasi antar program dalam Massive Problem Project?",
                "Apa tujuan utama Massive Problem Project ini?"
            ],
            "responses": [
                "Massive Problem Project adalah tantangan 10 minggu di mana peserta bersama kelompoknya mengembangkan solusi berupa produk digital seperti website dan aplikasi, untuk menyelesaikan masalah yang diangkat, yang melibatkan penelitian, wawancara dengan stakeholders, dan penggunaan jurnal, serta mengimplementasikan SCRUM dalam prosesnya. Proyek ini juga mencakup Collaboration Project, memberikan kesempatan bagi kelompok untuk berkolaborasi dengan program lain seperti Web Development, Mobile Development, dan Advance Artificial Intelligence (AAI), memungkinkan pertukaran pengetahuan dan pengalaman untuk menyelesaikan masalah kompleks. Proses pengerjaan menggunakan framework design thinking (research, problem, idea, prototype, dan test)",
                "Selama 10 minggu, peserta dalam Massive Problem Project berkolaborasi untuk menghasilkan solusi digital, seperti aplikasi atau website, yang dapat menyelesaikan masalah yang diangkat. Proyek ini melibatkan riset, wawancara dengan stakeholders, serta jurnal, menggunakan metode SCRUM dalam pelaksanaannya. Collaboration Project memberi kesempatan peserta untuk berkolaborasi dengan tim lain dari Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI) untuk memperluas wawasan dan memecahkan masalah kompleks. Framework design thinking diterapkan sepanjang proses pengembangan produk (research, problem, idea, prototype, dan test).",
                "Dalam Massive Problem Project, peserta akan menghabiskan 10 minggu untuk mengembangkan solusi berupa produk digital seperti website atau aplikasi, untuk mengatasi masalah yang dihadapi. Proyek ini mencakup penelitian, wawancara dengan stakeholders, dan penggunaan jurnal, dengan penerapan SCRUM dalam setiap langkahnya. Selain itu, proyek ini juga memberi kesempatan bagi peserta untuk berkolaborasi dengan program lain, seperti Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI), untuk berbagi pengetahuan dan pengalaman dalam memecahkan masalah bersama. Proses pengembangan mengikuti framework design thinking (research, problem, idea, prototype, dan test).",
                "Massive Problem Project adalah tantangan selama 10 minggu yang mengajak peserta bekerja dalam kelompok untuk menciptakan produk digital yang dapat menyelesaikan permasalahan yang ada. Proyek ini melibatkan riset, wawancara dengan stakeholders, serta pemanfaatan jurnal dalam penyusunannya, dengan metode SCRUM sebagai acuan. Selain itu, Collaboration Project memberi kesempatan kepada tim untuk bekerja sama dengan program lain seperti Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI), guna meningkatkan pengetahuan dan menyelesaikan masalah lintas disiplin. Framework design thinking digunakan dalam proses (research, problem, idea, prototype, dan test).",
                "Selama 10 minggu, peserta Massive Problem Project berfokus pada pengembangan produk digital, baik aplikasi atau website, untuk menyelesaikan masalah yang diangkat. Riset, wawancara dengan stakeholders, serta pemanfaatan jurnal menjadi bagian dari prosesnya, dan SCRUM diterapkan dalam pengerjaan. Program Collaboration Project memberikan kesempatan kepada peserta untuk berkolaborasi dengan tim Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI), memperkaya pengetahuan dan pengalaman dalam memecahkan masalah yang kompleks. Semua proses mengikuti framework design thinking (research, problem, idea, prototype, dan test).",
                "Peserta Massive Problem Project akan mengembangkan solusi digital seperti aplikasi atau website dalam 10 minggu untuk menyelesaikan masalah yang diangkat. Riset, wawancara dengan stakeholders, dan penggunaan jurnal adalah bagian dari tahapan yang dilalui, dengan SCRUM diterapkan untuk mengelola proyek. Collaboration Project memungkinkan peserta berkolaborasi dengan tim Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI), untuk memperluas pengetahuan dan pengalaman dalam menghadapi masalah kompleks. Pendekatan design thinking (research, problem, idea, prototype, dan test) diintegrasikan sepanjang proses.",
                "Dalam Massive Problem Project, peserta bekerja dalam tim selama 10 minggu untuk mengembangkan solusi berupa aplikasi atau website yang dapat menyelesaikan masalah yang dihadapi. Proyek ini mencakup riset, wawancara dengan stakeholders, dan jurnal, dengan SCRUM diterapkan sebagai metode dalam proses pengembangan. Collaboration Project memungkinkan peserta berkolaborasi dengan tim Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI) untuk bertukar wawasan dalam menyelesaikan masalah kompleks. Semua tahapan dikerjakan dengan pendekatan design thinking (research, problem, idea, prototype, dan test).",
                "Massive Problem Project adalah program 10 minggu yang mendorong peserta untuk mengembangkan produk digital, seperti aplikasi dan website, sebagai solusi untuk masalah yang ada. Proyek ini menggunakan riset, wawancara dengan stakeholders, serta jurnal dalam pengembangannya, dan menerapkan SCRUM dalam prosesnya. Selain itu, program Collaboration Project memberi kesempatan bagi peserta untuk bekerja sama dengan tim Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI) dalam menyelesaikan masalah kompleks. Framework design thinking diterapkan dalam pengembangan produk (research, problem, idea, prototype, dan test).",
                "Peserta Massive Problem Project akan bekerja sama dalam kelompok untuk menciptakan aplikasi atau website yang menjadi solusi masalah dalam 10 minggu. Proyek ini melibatkan riset, wawancara dengan stakeholders, serta pemanfaatan jurnal, dan diterapkan SCRUM dalam setiap langkahnya. Collaboration Project memberi peserta kesempatan untuk berkolaborasi dengan tim lain, seperti Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI), untuk berbagi pengalaman dalam menyelesaikan masalah. Framework design thinking diterapkan dalam setiap tahap pengembangan produk (research, problem, idea, prototype, dan test).",
                "Dalam Massive Problem Project, peserta akan menghabiskan 10 minggu untuk mengembangkan produk digital berupa aplikasi atau website, guna menyelesaikan masalah yang diangkat. Proses ini melibatkan riset, wawancara dengan stakeholders, dan pemanfaatan jurnal, dengan SCRUM diterapkan untuk mengelola proyek. Program Collaboration Project memberi kesempatan bagi peserta untuk bekerja bersama tim Web Development, Mobile Development, dan Advanced Artificial Intelligence (AAI), untuk mengatasi masalah yang lebih kompleks. Semua tahapan pengembangan produk dilakukan dengan menggunakan design thinking (research, problem, idea, prototype, dan test).",
                "Massive Problem Project berlangsung 10 minggu, dimana peserta membuat solusi digital lengkap seperti aplikasi atau website untuk menyelesaikan masalah nyata.",
                "Peserta bekerja dalam tim menggunakan metode SCRUM dan design thinking untuk mengelola dan mengembangkan produk digital.",
                "Kolaborasi antar tim dari berbagai program seperti Web, Mobile, dan AI memungkinkan berbagi pengetahuan dan penyelesaian masalah kompleks.",
                "Tujuan utama Massive Problem Project adalah menghasilkan produk digital yang dapat memberikan solusi nyata terhadap masalah yang diangkat.",
                "Seluruh proses dilakukan secara iteratif dengan tahapan research, problem identification, ideation, prototyping, dan testing.",
                "Proyek ini juga memberikan pengalaman bekerja secara tim dalam lingkungan yang mirip industri teknologi digital.",
                "Peserta didampingi mentor dan fasilitator untuk memastikan proses pengembangan berjalan efektif dan sesuai target.",
                "Metode SCRUM membantu peserta dalam mengelola tugas dan progres proyek secara terstruktur.",
                "Massive Problem Project menggabungkan aspek riset, wawancara dengan stakeholder, dan pemanfaatan jurnal sebagai dasar solusi.",
                "Dengan mengikuti proyek ini, peserta siap menghadapi tantangan kerja kolaboratif dalam pengembangan produk digital."
            ]
        },
        {
            "tag": "tribe",
            "patterns": [
                "Apa yang dimaksud TRIBE?",
                "Bisakah dijelaskan apa yang dimaksud dengan TRIBE?",
                "TRIBE adalah apa?",
                "Apa yang dimaksud dengan istilah TRIBE?",
                "Ceritakan tentang TRIBE.",
                "Apa arti dari TRIBE dalam konteks ini?",
                "Bagaimana pengertian TRIBE dijelaskan?",
                "Dapatkah Anda menjelaskan konsep TRIBE?",
                "Apa yang dimaksud istilah TRIBE secara umum?",
                "TRIBE merujuk pada apa?",
                "Bagaimana cara menjadi bagian dari TRIBE?",
                "Apa peran TRIBE dalam program MSIB?",
                "Berapa jumlah anggota dalam TRIBE tiap mitra?",
                "Apa manfaat bergabung di TRIBE?",
                "Bagaimana TRIBE mendukung peserta program?",
                "Apa aktivitas yang dilakukan oleh TRIBE?",
                "Siapa yang memilih anggota TRIBE?",
                "Apa hubungan TRIBE dengan tim MSIB?",
                "Bagaimana TRIBE membantu pengembangan soft skill?",
                "Apa tujuan utama TRIBE dibentuk?"
            ],
            "responses": [
                "TRIBE adalah perwakilan mahasiswa yang dipilih dari setiap mitra, di mana setiap mitra mengirimkan dua peserta untuk menjadi bagian dari TRIBE. Peran utama TRIBE adalah sebagai jembatan komunikasi antara tim MSIB dengan peserta yang mengikuti program magang atau Studi Independen di mitra. Selain itu, TRIBE juga mengikuti berbagai kegiatan yang dirancang untuk mengembangkan soft skill mereka, dengan harapan kemampuan tersebut dapat dimanfaatkan untuk mendukung mahasiswa lain dalam menjalankan program MSIB di mitra masing-masing.",
                "Sebagai jembatan komunikasi, TRIBE terdiri dari dua mahasiswa per mitra yang dipilih untuk mewakili dan mendukung komunikasi antara tim MSIB dan peserta program.",
                "TRIBE adalah kelompok mahasiswa yang dipilih oleh mitra, berperan sebagai penghubung komunikasi antara tim MSIB dan mahasiswa yang mengikuti program magang atau Studi Independen.",
                "Setiap mitra mengirimkan dua peserta untuk menjadi bagian dari TRIBE, yang bertugas menjembatani komunikasi antara peserta program dengan tim MSIB.",
                "TRIBE adalah wadah yang diisi oleh perwakilan mahasiswa dari tiap mitra, dengan tugas utama mendukung komunikasi antara peserta program dan tim MSIB.",
                "TRIBE, yang terdiri dari dua mahasiswa per mitra, berperan penting dalam menghubungkan tim MSIB dengan peserta magang atau Studi Independen di mitra.",
                "Melalui TRIBE, dua mahasiswa dari setiap mitra berperan aktif sebagai jembatan komunikasi antara peserta program dan tim MSIB.",
                "Anggota TRIBE, yang dipilih dari mahasiswa tiap mitra, bertugas menjembatani peserta program dengan tim MSIB, sekaligus mengembangkan soft skill mereka.",
                "TRIBE adalah perwakilan dari mahasiswa mitra yang berfungsi memfasilitasi komunikasi antara tim MSIB dengan mahasiswa peserta program.",
                "Sebagai penghubung, TRIBE terdiri dari dua mahasiswa per mitra yang membantu memperlancar komunikasi antara peserta magang atau Studi Independen dan tim MSIB.",
                "TRIBE merupakan perwakilan mahasiswa dari tiap mitra yang dipilih untuk menjadi penghubung antara peserta dan tim MSIB.",
                "Peran TRIBE adalah membantu komunikasi dan koordinasi agar program berjalan lancar serta mendukung peserta di mitra masing-masing.",
                "Setiap mitra memilih dua mahasiswa untuk menjadi anggota TRIBE yang aktif dalam berbagai kegiatan program.",
                "Dengan bergabung di TRIBE, mahasiswa dapat mengembangkan kemampuan komunikasi dan kepemimpinan.",
                "TRIBE berperan sebagai mediator informasi antara peserta program dan tim MSIB agar semua pihak terhubung.",
                "Aktivitas TRIBE meliputi pengorganisasian acara, penyebaran informasi, dan monitoring kegiatan peserta.",
                "Pemilihan anggota TRIBE dilakukan oleh mitra program berdasarkan kriteria tertentu seperti kemampuan komunikasi dan komitmen.",
                "TRIBE membantu memastikan peserta mendapatkan dukungan penuh selama menjalani program MSIB.",
                "Melalui TRIBE, peserta juga dapat memperluas jaringan sosial dan profesional selama program.",
                "Tujuan TRIBE adalah memfasilitasi koordinasi serta meningkatkan kualitas pengalaman belajar peserta di MSIB."
            ]
        },
        {
            "tag": "lms",
            "patterns": [
                "Bagaimana cara untuk mendapatkan akses ke LMS?",
                "Apa prosedur untuk mendapatkan akses ke LMS?",
                "Bagaimana cara memperoleh akses ke LMS?",
                "Langkah apa saja yang diperlukan untuk login ke LMS?",
                "Bagaimana tahapan untuk bisa menggunakan LMS?",
                "Apa yang harus dilakukan untuk mendapatkan akses ke LMS?",
                "Bagaimana cara registrasi dan akses ke LMS?",
                "Apa saja yang diperlukan untuk bisa mengakses LMS?",
                "Bagaimana cara masuk ke sistem LMS?",
                "Apa proses untuk memperoleh akses ke LMS?",
                "Bagaimana cara akses LMS MSIB?",
                "Apa kegunaan LMS dalam program MSIB?",
                "Apakah materi program tersedia di LMS?",
                "Bagaimana cara mengerjakan tugas lewat LMS?",
                "Apa fitur utama LMS yang digunakan?",
                "Apakah LMS bisa diakses lewat HP?",
                "Bagaimana cara cek progress belajar di LMS?",
                "Apakah LMS menyediakan forum diskusi?",
                "Bagaimana cara mengunduh materi dari LMS?",
                "Apakah ada batas waktu mengerjakan tugas di LMS?"
            ],
            "responses": [
                "Kamu bakal dapat email khusus dari Infinite Learning, lengkap sama password-nya, jadi bisa langsung login ke LMS.",
                "Tenang aja, Infinite Learning akan ngirimin email dan password supaya kamu bisa akses LMS dengan mudah.",
                "Nanti Infinite Learning kasih kamu email dan password biar gampang masuk ke LMS.",
                "Akses LMS itu simpel kok, kamu tinggal pakai email dan password yang bakal dikirim sama Infinite Learning.",
                "Infinite Learning bakal ngirimin kamu email beserta password untuk login ke LMS.",
                "Email dan password dari Infinite Learning akan mempermudah kamu buat masuk ke LMS.",
                "Nanti Infinite Learning kasih akses ke LMS lewat email dan password yang bakal mereka kirim ke kamu.",
                "Buat akses LMS, kamu tinggal tunggu email dari Infinite Learning yang isinya login details.",
                "Kamu cukup pakai email dan password dari Infinite Learning buat login ke LMS.",
                "Infinite Learning bakal kasih semua informasi login, jadi kamu bisa langsung akses LMS tanpa ribet.",
                "LMS MSIB adalah platform digital untuk mengakses materi pembelajaran, tugas, dan jadwal program secara mudah.",
                "Peserta dapat mengerjakan tugas, mengikuti quiz, dan melihat perkembangan belajar melalui LMS.",
                "Semua materi pembelajaran program disediakan lengkap di LMS agar bisa diakses kapan saja.",
                "LMS juga menyediakan fitur forum diskusi untuk komunikasi antar peserta dan mentor.",
                "Platform LMS dapat diakses melalui perangkat komputer maupun ponsel dengan koneksi internet.",
                "Melalui LMS, peserta dapat memantau progress belajar dan hasil penilaian tugas secara real-time.",
                "LMS memudahkan peserta mengumpulkan tugas dan mengikuti ujian online.",
                "Fitur reminder di LMS membantu peserta mengingat jadwal penting program.",
                "Peserta juga dapat mengunduh materi untuk dipelajari secara offline melalui LMS.",
                "Batas waktu pengumpulan tugas biasanya tercantum jelas di LMS untuk membantu manajemen waktu peserta."
            ]
        },
        {
            "tag": "logbook",
            "patterns": [
                "Apa saja ketentuan dalam mengisi logbook bulanan?",
                "Bagaimana cara yang benar untuk mengisi logbook?",
                "Apa ketentuan yang harus diikuti saat mengisi logbook?",
                "Bagaimana format pengisian logbook yang sesuai?",
                "Apa panduan resmi dalam mengisi logbook?",
                "Ada aturan tertentu dalam pengisian logbook?",
                "Bagaimana langkah-langkah untuk mengisi logbook?",
                "Apa yang perlu diperhatikan saat mengisi logbook?",
                "Apa saja hal penting yang harus dicantumkan di logbook?",
                "Bagaimana cara memastikan pengisian logbook sesuai ketentuan?",
                "Bagaimana prosedur pengisian logbook yang benar?",
                "Apa saja hal yang wajib ditulis di logbook bulanan?",
                "Bagaimana cara mengisi logbook dengan baik dan benar?",
                "Apa saja aturan penting dalam membuat logbook bulanan?",
                "Bisa jelaskan cara mengisi logbook yang tepat?",
                "Bagaimana supaya logbook bulanan bisa diterima dengan baik?",
                "Apa saja detail yang harus ada dalam logbook bulanan?",
                "Bagaimana format standar untuk pengisian logbook bulanan?",
                "Apa tips supaya logbook bisa diisi dengan benar?",
                "Bagaimana cara mencatat kegiatan dengan tepat di logbook?"
            ],
            "responses": [
                "Isi logbook bulanan dengan menjawab setiap poin yang diminta, minimal panjangnya 200 kata ya.",
                "Pastikan kamu menjawab semua poin di logbook bulanan dengan jelas, minimal 200 kata ya Inners.",
                "Logbook bulanan perlu diisi dengan jawaban untuk setiap poin, usahakan minimal 200 kata biar lengkap.",
                "Cukup jawab poin-poin di logbook bulanan dengan detail, sekitar 200 kata sudah oke.",
                "Untuk mengisi logbook, jawab setiap poin yang tertera dengan jelas, minimal 200 kata per laporan ya.",
                "Logbook bulanan harus diisi dengan jawaban lengkap untuk setiap poin, panjangnya minimal 200 kata.",
                "Isi logbook dengan menuliskan jawaban yang detail untuk setiap poin, cukup 200 kata atau lebih biar pas.",
                "Kamu cukup menjawab poin-poin di logbook dengan jelas dan lengkap, 200 kata per laporan sudah cukup.",
                "Pastikan kamu menuliskan jawaban untuk setiap poin di logbook, minimalnya sih 200 kata per laporan.",
                "Jawab semua poin di logbook bulanan dengan detail, jangan lupa panjangnya minimal 200 kata ya.",
                "Lengkapi logbook dengan menjawab seluruh pertanyaan secara jelas, minimal 200 kata tiap laporan.",
                "Jangan lupa menulis di logbook dengan detail tiap poin, sekitar 200 kata agar lengkap dan informatif.",
                "Pastikan semua bagian di logbook diisi dengan jawaban yang lengkap dan minimal 200 kata tiap bulan.",
                "Isi logbook secara teliti dan jawab tiap poin dengan jelas, minimal 200 kata supaya lengkap.",
                "Tuliskan jawaban yang jelas dan padat untuk tiap poin di logbook, usahakan sekitar 200 kata ya.",
                "Pengisian logbook harus lengkap dengan jawaban tiap poin, minimal 200 kata agar informatif.",
                "Pastikan setiap pertanyaan di logbook terjawab dengan baik, sekitar 200 kata untuk tiap laporan.",
                "Jawaban dalam logbook sebaiknya detail dan lengkap, sekitar 200 kata untuk tiap bagian yang ada.",
                "Isi logbook bulanan dengan memperhatikan semua poin dan panjang minimal 200 kata setiap laporan.",
                "Berikan jawaban rinci dan jelas di logbook untuk tiap poin, minimal 200 kata per laporan ya."
            ]
        },
        {
            "tag": "final_micro",
            "patterns": [
                "Apa saja yang perlu dipersiapkan pada final Micro Challenge?",
                "Apa persiapan yang dibutuhkan untuk final Micro Challenge?",
                "Hal apa yang perlu dipersiapkan saat final Micro Challenge?",
                "Apa yang harus dilakukan sebelum final Micro Challenge?",
                "Apa saja langkah persiapan untuk final Micro Challenge?",
                "Persiapan apa yang perlu diperhatikan untuk final Micro Challenge?",
                "Apa yang perlu disiapkan untuk menghadapi final Micro Challenge?",
                "Hal apa yang penting untuk dipersiapkan pada final Micro Challenge?",
                "Apa saja yang wajib disiapkan saat final Micro Challenge?",
                "Persiapan apa yang harus dilakukan untuk mengikuti final Micro Challenge?",
                "Bagaimana cara mempersiapkan diri untuk final Micro Challenge?",
                "Apa saja dokumen yang harus disiapkan untuk final Micro Challenge?",
                "Hal penting apa yang harus diperhatikan sebelum final Micro Challenge?",
                "Apa yang harus dibawa saat mengikuti final Micro Challenge?",
                "Bagaimana supaya siap menghadapi final Micro Challenge dengan baik?",
                "Apa tips untuk persiapan final Micro Challenge agar sukses?",
                "Apa saja komponen penting yang harus disiapkan untuk final Micro Challenge?",
                "Langkah apa yang harus dilakukan agar siap saat final Micro Challenge?",
                "Bagaimana mempersiapkan presentasi untuk final Micro Challenge?",
                "Apa hal-hal utama yang harus dipersiapkan untuk final Micro Challenge?"
            ],
            "responses": [
                "Untuk Final Micro Challenge, pastikan kamu menyiapkan bahan presentasi yang mencakup riset produk, minimal 3 halaman MVP Wireframe, dan PowerPoint yang menarik. Jangan lupa isi form retro yang telah diberikan mentor, nyalakan kamera, dan pastikan koneksi internetmu stabil. Percaya diri saat menjawab pertanyaan ya!",
                "Persiapan Final Micro Challenge meliputi bahan presentasi dengan latar belakang riset produk, minimal 3 halaman wireframe, PowerPoint yang eye-catching, dan pastikan kamu sudah mengisi form retro yang diberikan mentor. Siapkan diri untuk tampil percaya diri di depan kamera!",
                "Pastikan semua sudah siap untuk Final Micro Challenge, termasuk bahan presentasi hasil riset produk, wireframe minimal 3 halaman, PowerPoint yang rapi, dan form retro yang sudah diisi. Nyalakan kamera, cek koneksi internet, dan jawab pertanyaan mentor dengan tenang.",
                "Untuk menghadapi Final Micro Challenge, kamu perlu menyiapkan bahan presentasi riset produk, wireframe 3 halaman, dan PowerPoint menarik. Jangan lupa isi form retro dari mentor, aktifkan kamera, dan persiapkan dirimu untuk menjawab pertanyaan dengan percaya diri.",
                "Hal yang perlu disiapkan untuk Final Micro Challenge adalah bahan presentasi riset produk, minimal 3 halaman wireframe, PowerPoint yang memukau, dan form retro yang sudah diisi. Pastikan kamera aktif, koneksi stabil, dan siapkan mentalmu untuk tampil maksimal.",
                "Jangan lupa untuk menyiapkan bahan presentasi riset produk, MVP Wireframe minimal 3 halaman, dan PowerPoint yang kreatif. Pastikan juga kamu sudah mengisi form retro dari mentor sebelum Final Micro Challenge dimulai!",
                "Untuk Final Micro Challenge, siapkan bahan presentasi yang detail, wireframe minimal 3 halaman, PowerPoint yang menarik, dan form retro yang sudah diisi. Pastikan kamera on dan koneksi lancar agar presentasimu berjalan mulus.",
                "Persiapan Final Micro Challenge mencakup bahan presentasi riset produk, wireframe minimal 3 halaman, PowerPoint keren, dan form retro yang sudah diisi. Jangan lupa nyalakan kamera, pastikan internetmu stabil, dan tampil percaya diri ya!",
                "Sebelum Final Micro Challenge, pastikan kamu menyiapkan riset produk, wireframe minimal 3 halaman, dan PowerPoint yang rapi. Isi form retro dari mentor, cek koneksi internetmu, dan siapkan diri untuk menjawab pertanyaan dengan profesional.",
                "Untuk sukses di Final Micro Challenge, kamu perlu menyiapkan bahan presentasi riset produk, wireframe 3 halaman, PowerPoint yang menarik, dan jangan lupa isi form retro dari mentor. Nyalakan kamera, cek koneksi, dan yakinlah pada kemampuanmu!",
                "Pastikan kamu sudah mempersiapkan bahan presentasi lengkap dengan riset produk dan wireframe minimal 3 halaman untuk Final Micro Challenge.",
                "Siapkan PowerPoint yang menarik dan informatif serta isi form retro sebelum mengikuti Final Micro Challenge.",
                "Jangan lupa cek koneksi internet dan nyalakan kamera agar presentasi di Final Micro Challenge berjalan lancar.",
                "Latih diri untuk menjawab pertanyaan mentor dengan percaya diri saat Final Micro Challenge berlangsung.",
                "Susun presentasi dengan urutan yang jelas mulai dari riset produk hingga demo MVP untuk Final Micro Challenge.",
                "Perhatikan semua detail bahan presentasi agar tidak ada yang terlewat saat Final Micro Challenge.",
                "Gunakan desain PowerPoint yang menarik supaya presentasi Final Micro Challenge makin maksimal.",
                "Pastikan kamu sudah memahami riset produk dan wireframe sebelum presentasi Final Micro Challenge.",
                "Buat catatan penting sebagai bahan jawaban jika ada pertanyaan saat Final Micro Challenge.",
                "Siapkan mental dan penampilan terbaik untuk tampil percaya diri di Final Micro Challenge."
            ]
        },
        {
            "tag": "tukar_sesi",
            "patterns": [
                "Bagaimana cara agar dapat tukar sesi?",
                "Apa langkah-langkah untuk tukar sesi?",
                "Bagaimana jika saya tidak dapat mengikuti sesi, dan ingin melakukan tukar sesi?",
                "Bagaimana prosedur untuk tukar sesi?",
                "Apa saja yang harus dilakukan untuk menukar sesi?",
                "Apakah memungkinkan untuk mengganti sesi yang sudah dijadwalkan?",
                "Bagaimana mekanisme penukaran sesi?",
                "Apa syarat untuk melakukan tukar sesi?",
                "Bagaimana jika saya ingin melakukan tukar sesi?",
                "Apa langkah yang diperlukan untuk tukar sesi?",
                "Bisakah saya pindah sesi jika jadwal bentrok?",
                "Langkah apa yang harus diambil untuk mengganti sesi kelas?",
                "Siapa yang harus saya hubungi untuk tukar sesi?",
                "Apakah ada batas waktu untuk tukar sesi?",
                "Bolehkah tukar sesi jika sudah terdaftar?",
                "Bagaimana proses tukar sesi jika saya tidak bisa hadir?",
                "Dapatkah saya mengganti jadwal sesi saya?",
                "Apa prosedur tepat tukar sesi di program ini?",
                "Bagaimana cara formal untuk tukar sesi?",
                "Apakah tukar sesi perlu persetujuan mentor?"
            ],
            "responses": [
                "Kalau kamu mau tukar sesi, langsung hubungi mentor personal sebelum sesi dimulai ya. Nanti mentor akan kasih link untuk isi form tukar sesi.",
                "Tukar sesi bisa dilakukan dengan kontak mentor personal dulu. Setelah konfirmasi, kamu bakal dapat link form tukar sesi.",
                "Hubungi mentor personal kamu sebelum sesi dimulai untuk tukar sesi, nanti mereka akan memberikan link form yang harus diisi.",
                "Untuk ganti sesi, pastikan kamu komunikasi dulu dengan mentor personal. Setelah disetujui, isi form tukar sesi yang diberikan.",
                "Jika ingin tukar sesi, diskusikan dengan mentor personal terlebih dahulu. Link form tukar sesi akan diberikan setelah konfirmasi.",
                "Proses tukar sesi dimulai dengan menghubungi mentor personal sebelum sesi berlangsung. Mentor akan mengirimkan link untuk formnya.",
                "Kamu bisa tukar sesi dengan menghubungi mentor personal dan menunggu konfirmasi. Setelah itu, isi form tukar sesi dari mentor.",
                "Mentor personal adalah kontak pertama untuk tukar sesi. Setelah diskusi, mereka akan memberikan link form untuk menyelesaikan prosesnya.",
                "Tukar sesi hanya bisa dilakukan jika kamu menghubungi mentor personal sebelumnya. Setelah itu, isi form tukar sesi sesuai petunjuk.",
                "Pastikan untuk berbicara dengan mentor personal tentang tukar sesi sebelum jadwal dimulai. Isi form tukar sesi setelah mentor memberikannya.",
                "Untuk pindah sesi, hubungi mentor terlebih dahulu agar bisa dikonfirmasi dan diberikan link form tukar sesi.",
                "Kalau jadwal sesi bentrok, segera informasikan ke mentor personal untuk proses tukar sesi dengan mengisi form yang disediakan.",
                "Sebelum tukar sesi, konsultasikan dulu ke mentor personal. Mereka akan memberikan instruksi lebih lanjut untuk proses tukar sesi.",
                "Tukar sesi perlu koordinasi dengan mentor personal supaya prosesnya lancar dan kamu dapat link form tukar sesi.",
                "Hubungi mentor personal sesegera mungkin untuk meminta tukar sesi dan mengikuti prosedur yang berlaku di program.",
                "Jika tidak bisa hadir sesi, segera beri tahu mentor personal dan isi form tukar sesi yang akan diberikan.",
                "Ganti sesi bisa dilakukan dengan persetujuan mentor, jadi pastikan kamu sudah komunikasi dan isi form tukar sesi.",
                "Tukar sesi diatur oleh mentor personal, jadi jangan lupa diskusi dulu sebelum mengajukan permintaan tukar sesi.",
                "Form tukar sesi akan diberikan oleh mentor setelah kamu konfirmasi keinginan tukar sesi.",
                "Selalu koordinasikan ke mentor untuk tukar sesi supaya prosesnya jelas dan kamu dapat form resmi tukar sesi."
            ]
        },
        {
            "tag": "massive_final",
            "patterns": [
                "Apa saja yang harus disiapkan untuk Final Massive Challenge?",
                "Apa yang perlu dipersiapkan sebelum Final Massive Challenge?",
                "Apa persiapan penting untuk menghadapi Final Massive Challenge?",
                "Hal apa saja yang harus dipersiapkan untuk Final Massive Challenge?",
                "Bagaimana cara mempersiapkan diri untuk Final Massive Challenge?",
                "Apa yang harus dilakukan sebelum Final Massive Challenge?",
                "Apa saja yang wajib disiapkan untuk Final Massive Challenge?",
                "Persiapan apa yang diperlukan untuk menghadapi Final Massive Challenge?",
                "Apa saja langkah persiapan untuk Final Massive Challenge?",
                "Apa yang harus dipastikan sebelum Final Massive Challenge dimulai?",
                "Apa saja yang wajib disiapkan untuk Final Massive Challenge?",
                "Persiapan apa yang diperlukan untuk menghadapi Final Massive Challenge?",
                "Apa saja langkah persiapan untuk Final Massive Challenge?",
                "Apa yang harus dipastikan sebelum Final Massive Challenge dimulai?",
                "Bagaimana mempersiapkan presentasi untuk Final Massive Challenge?",
                "Apa tips agar sukses di Final Massive Challenge?",
                "Hal penting apa yang harus dibawa saat Final Massive Challenge?",
                "Bagaimana cara membuat demo yang efektif untuk Final Massive Challenge?",
                "Apa yang harus diperhatikan untuk video showcase di Final Massive Challenge?",
                "Langkah apa yang paling krusial saat menghadapi Final Massive Challenge?",
                "Bagaimana memastikan ide proyek jelas saat presentasi Final Massive Challenge?",
                "Apa yang harus ditonjolkan saat pitching di Final Massive Challenge?",
                "Bagaimana membuat Call To Action yang efektif di Final Massive Challenge?",
                "Apa komponen utama yang harus ada di presentasi Final Massive Challenge?"
            ],
            "responses": [
                "Untuk menghadapi final massive challenge, kamu perlu siap presentasi dengan teknik pitching yang oke, ceritakan proyek kamu dengan cerita yang menarik, lalu jelaskan ide, masalah yang dihadapi, solusi yang diusulkan, demo fitur MVP, video showcase, dan jangan lupa untuk mengajak audiens coba produk kalian lewat Call To Action.",
                "Di final massive challenge, pastikan presentasi kamu sudah ready dengan pitching yang engaging, cerita yang seru, lalu bahas project idea, masalah yang mau diselesaikan, solusi, demo fitur MVP, dan video showcase. Terakhir, ingat untuk selalu ada Call To Action untuk ajak audiens coba produk kamu.",
                "Untuk tampil maksimal di final massive challenge, buatlah presentasi dengan pitching yang santai tapi jelas, ceritakan ide proyek, masalah yang dihadapi, solusinya, demo fitur MVP, dan video showcase. Jangan lupa, pastikan ada Call To Action untuk mendorong audiens mencoba produk kalian.",
                "Saat final massive challenge, pastikan presentasi kamu punya pitching yang menarik dan cerita yang bagus, jelaskan ide proyek, masalah, solusi, demo fitur MVP, dan video showcase. Terakhir, tambahkan Call To Action untuk mengajak audiens mencoba produk kalian.",
                "Persiapkan presentasi final massive challenge dengan pitching yang menarik, ceritakan tentang project idea, problem yang kamu pecahkan, solusi, demo fitur MVP, dan video showcase. Dan jangan lupa, pastikan ada Call To Action yang ngajak audiens buat coba produk kamu.",
                "Final massive challenge itu tentang presentasi yang menarik, jadi pastikan pitching kamu solid dan cerita kamu meyakinkan. Bahas project idea, masalah, solusi, demo fitur MVP, dan video showcase, lalu tutup dengan Call To Action yang ajak audiens mencoba produk kalian.",
                "Untuk sukses di final massive challenge, kamu harus siap presentasi dengan pitching yang jelas dan cerita yang menarik, bahas project idea, masalah, solusi, demo fitur MVP, dan jangan lupa tampilkan video showcase. Akhiri dengan Call To Action yang mengajak audiens menggunakan produk kamu.",
                "Di final massive challenge, pastikan presentasi kamu punya pitching yang oke, ceritakan proyek kamu dengan story telling yang menarik, lalu jelaskan ide, masalah, solusi, demo fitur MVP, dan jangan lupa untuk ada Call To Action yang ajak audiens coba produk kalian.",
                "Untuk final massive challenge, buat presentasi dengan pitching yang engaging dan cerita yang menarik. Jangan lupa jelaskan project idea, masalah, solusi, demo fitur MVP, dan video showcase. Terakhir, pastikan ada Call To Action untuk mendorong audiens mencoba produk kalian.",
                "Untuk menghadapi final massive challenge, persiapkan presentasi dengan pitching yang baik, cerita yang mengalir, serta jelaskan project idea, masalah, solusi, demo fitur MVP, video showcase, dan pastikan ada Call To Action yang mengajak audiens untuk coba produk kamu.",
                "Persiapkan slide presentasi yang jelas dan menarik agar bisa menyampaikan ide proyek dengan baik saat final massive challenge.",
                "Jangan lupa latih pitching kamu agar lebih percaya diri dan mampu menjelaskan solusi dari masalah yang kamu angkat di final massive challenge.",
                "Siapkan demo fitur utama (MVP) yang berjalan dengan baik agar bisa meyakinkan juri dan audiens saat final massive challenge.",
                "Pastikan video showcase kamu singkat tapi padat, menampilkan keunggulan produk dengan visual yang menarik.",
                "Fokuslah pada storytelling yang menghubungkan ide proyek dengan kebutuhan pengguna saat mempersiapkan final massive challenge.",
                "Gunakan Call To Action yang jelas dan persuasif untuk mendorong audiens agar mencoba produkmu saat final massive challenge.",
                "Latih pertanyaan dan jawaban untuk sesi tanya jawab agar kamu siap menghadapi juri dan audiens di final massive challenge.",
                "Susun presentasi dengan alur logis mulai dari masalah, solusi, demo, hingga video showcase agar audiens mudah mengikuti.",
                "Jelaskan nilai tambah produkmu dengan jelas untuk membedakan dari proyek lain di final massive challenge.",
                "Gunakan bahasa tubuh yang percaya diri dan kontak mata saat pitching agar presentasi kamu semakin meyakinkan."
            ]
        },
        {
            "tag": "sertifikat",
            "patterns": [
                "Kapan nilai dan sertifikat bisa didapatkan?",
                "Sertifikat dan nilai akan diterima kapan?",
                "Berapa lama hingga sertifikat dan nilai dibagikan?",
                "Kapan peserta akan mendapatkan sertifikat dan nilai?",
                "Sertifikat serta nilai akan tersedia kapan?",
                "Kapan jadwal pembagian sertifikat dan nilai?",
                "Berapa lama waktu tunggu untuk nilai dan sertifikat?",
                "Kapan waktu yang tepat untuk mendapatkan nilai dan sertifikat?",
                "Sertifikat dan nilai akan diberikan setelah apa?",
                "Kapan hasil nilai dan sertifikat diumumkan?",
                "Berapa lama proses pengiriman sertifikat dan nilai?",
                "Apa waktu estimasi untuk terima sertifikat dan nilai?",
                "Kapan saya bisa cek nilai dan ambil sertifikat?",
                "Berapa lama menunggu sertifikat dan hasil nilai selesai diproses?",
                "Kapan sertifikat serta nilai bisa saya dapatkan setelah program?",
                "Kapan saya akan menerima sertifikat dan nilai akhir?",
                "Kapan sertifikat akan dikirimkan ke peserta?",
                "Seberapa cepat nilai dan sertifikat dapat diterima setelah program?",
                "Apa jadwal resmi untuk pembagian sertifikat dan nilai?",
                "Kapan peserta bisa menerima hasil nilai dan sertifikat resmi?"
            ],
            "responses": [
                "Sertifikat dan nilai biasanya akan diberikan sekitar 2-4 minggu setelah program selesai. Kalau kamu butuh nilai sementara untuk konversi, jangan ragu untuk menghubungi mentor personalmu.",
                "Kamu akan menerima sertifikat dan nilai dalam 2-4 minggu setelah program berakhir. Jika membutuhkan nilai lebih cepat, silakan koordinasi dengan mentor personal.",
                "Biasanya, sertifikat dan nilai akan tersedia 2-4 minggu setelah program selesai. Kalau ada kebutuhan mendesak untuk nilai, kamu bisa meminta bantuan mentor personal.",
                "Sertifikat dan nilai akan dikirimkan dalam waktu 2-4 minggu setelah program selesai. Untuk keperluan nilai sementara, kamu bisa konsultasikan dengan mentor personal.",
                "Setelah program selesai, sertifikat dan nilai akan diberikan dalam waktu 2-4 minggu. Jika membutuhkan nilai untuk konversi, mentor personal bisa membantu.",
                "Umumnya, sertifikat dan nilai akan siap 2-4 minggu setelah program selesai. Kalau butuh nilai sementara, segera hubungi mentor personal untuk arahan lebih lanjut.",
                "Sertifikat dan nilai akan didistribusikan 2-4 minggu pasca program selesai. Bila butuh nilai lebih awal, kamu bisa langsung kontak mentor personalmu.",
                "Dalam 2-4 minggu setelah program selesai, sertifikat dan nilai akan diberikan. Kalau ada kebutuhan mendesak terkait nilai, mentor personal bisa memberikan panduan.",
                "Kamu bisa menerima sertifikat dan nilai sekitar 2-4 minggu setelah program berakhir. Untuk kebutuhan nilai sementara, jangan sungkan hubungi mentor personal.",
                "Sertifikat dan nilai akan diberikan setelah program selesai, biasanya dalam 2-4 minggu. Kalau perlu nilai lebih cepat, koordinasikan langsung dengan mentor personal.",
                "Pengiriman sertifikat dan nilai biasanya memakan waktu 2-4 minggu setelah program selesai.",
                "Proses distribusi nilai dan sertifikat memakan waktu sekitar 2-4 minggu setelah program berakhir.",
                "Setelah selesai program, sertifikat dan nilai akan diterima dalam waktu 2 hingga 4 minggu.",
                "Nilai dan sertifikat akan diberikan dalam rentang waktu 2-4 minggu setelah program selesai.",
                "Estimasi waktu penerimaan sertifikat dan nilai adalah sekitar 2 sampai 4 minggu setelah program.",
                "Sertifikat serta nilai akan tersedia setelah 2-4 minggu sejak program selesai.",
                "Waktu tunggu untuk menerima sertifikat dan nilai adalah sekitar 2-4 minggu pasca program.",
                "Sertifikat dan nilai akan dikirimkan dalam kurun waktu 2 hingga 4 minggu setelah program selesai.",
                "Biasanya, nilai dan sertifikat bisa diterima dalam waktu 2-4 minggu setelah program berakhir.",
                "Setelah program selesai, kamu akan mendapatkan sertifikat dan nilai dalam waktu 2 sampai 4 minggu."
            ]
        },
        {
            "tag": "sertif_mendadak",
            "patterns": [
                "Bagaimana jika saya ingin mendapatkan sertifikat terlebih dahulu?",
                "Apakah saya bisa menerima sertifikat lebih cepat?",
                "Bagaimana cara mendapatkan sertifikat sebelum waktu biasanya?",
                "Bisakah saya meminta sertifikat lebih awal?",
                "Apa yang harus dilakukan jika saya membutuhkan sertifikat secepatnya?",
                "Bagaimana prosedur untuk mendapatkan sertifikat lebih awal?",
                "Apakah sertifikat bisa diberikan sebelum jadwal biasanya?",
                "Bagaimana cara mendapatkan sertifikat jika program belum selesai?",
                "Apakah mungkin menerima sertifikat lebih cepat dari waktu yang ditentukan?",
                "Apa langkah-langkah untuk meminta sertifikat lebih awal?",
                "Bisakah sertifikat diambil sebelum waktu resmi pembagian?",
                "Bagaimana cara mempercepat proses penerimaan sertifikat?",
                "Apakah ada cara agar sertifikat bisa diterima lebih cepat?",
                "Bolehkah saya mengajukan sertifikat sebelum program selesai?",
                "Apa kebijakan terkait permintaan sertifikat mendadak?",
                "Bagaimana jika saya butuh sertifikat dengan segera?",
                "Apakah sertifikat bisa dikirim sebelum waktu yang ditetapkan?",
                "Langkah apa yang harus diikuti untuk dapat sertifikat lebih awal?",
                "Bisakah saya mendapatkan sertifikat sebelum masa program berakhir?",
                "Apakah memungkinkan pengambilan sertifikat secara mendadak?"
            ],
            "responses": [
                "Maaf ya, sertifikat hanya akan diberikan setelah jadwal yang sudah ditentukan, tapi kalau kamu butuh untuk konversi nilai, kamu bisa minta nilai sementara ke mentor personal.",
                "Sayangnya, sertifikat tidak bisa diberikan lebih awal. Tapi jangan khawatir, nilai sementara bisa kamu minta ke mentor personal kalau diperlukan.",
                "Sertifikat akan dibagikan sesuai jadwal, jadi nggak bisa dipercepat. Kalau butuh untuk konversi, silakan hubungi mentor personal untuk nilai sementara.",
                "Kami mohon maaf, sertifikat nggak bisa dipercepat pembagiannya. Kalau kamu memerlukan untuk keperluan konversi, nilai sementara dapat disediakan oleh mentor personal.",
                "Untuk sertifikat, akan diberikan sesuai jadwal. Kalau mendesak, kamu bisa mengajukan permintaan nilai sementara ke mentor personal.",
                "Sertifikat hanya akan dibagikan sesuai jadwal yang telah ditetapkan. Tapi kalau butuh segera, nilai sementara bisa kamu tanyakan ke mentor personal.",
                "Kami memahami kebutuhanmu, namun sertifikat nggak bisa diterbitkan lebih awal. Kamu bisa menghubungi mentor personal untuk meminta nilai sementara.",
                "Maaf, sertifikat belum bisa diberikan lebih awal. Namun, nilai sementara dapat diminta ke mentor personal jika diperlukan untuk konversi.",
                "Sertifikat akan diserahkan pada waktu yang telah dijadwalkan. Kalau butuh cepat untuk keperluan tertentu, silakan minta nilai sementara dari mentor personal.",
                "Sertifikat akan dibagikan secara serentak sesuai jadwal. Kalau kamu butuh sesuatu untuk segera digunakan, mentor personal bisa memberikan nilai sementara.",
                "Sertifikat hanya diserahkan sesuai jadwal resmi, namun nilai sementara bisa kamu peroleh jika menghubungi mentor personal.",
                "Sayangnya, sertifikat tidak bisa diberikan sebelum waktunya. Tapi jika diperlukan, nilai sementara bisa kamu dapatkan dari mentor personal.",
                "Sertifikat tidak dapat diberikan sebelum jadwal, namun kamu dapat meminta nilai sementara untuk kebutuhan mendesak.",
                "Kami tidak bisa mempercepat pemberian sertifikat, tapi nilai sementara bisa kamu minta dari mentor personal.",
                "Sertifikat akan diserahkan sesuai waktu yang ditentukan, tapi nilai sementara bisa kamu dapatkan jika menghubungi mentor personal.",
                "Untuk sertifikat, mohon menunggu jadwal resmi. Nilai sementara tersedia jika kamu butuh untuk konversi atau keperluan lainnya.",
                "Mohon maaf, tidak ada kebijakan untuk mempercepat sertifikat, tapi nilai sementara bisa kamu peroleh dari mentor personal.",
                "Sertifikat hanya diberikan pada waktu yang sudah dijadwalkan, namun kamu bisa meminta nilai sementara jika butuh segera.",
                "Sertifikat tidak dapat diambil secara mendadak, tapi nilai sementara bisa kamu peroleh dengan menghubungi mentor personal.",
                "Saat ini, sertifikat hanya dibagikan sesuai jadwal, namun kamu dapat meminta nilai sementara dari mentor personal jika diperlukan."
            ]
        },
        {
            "tag": "akses_selesai",
            "patterns": [
                "Apakah saya masih bisa belajar dari materi LMS setelah program selesai?",
                "Apakah akses ke LMS tetap tersedia setelah program selesai?",
                "Setelah program berakhir, apakah saya masih bisa membuka materi di LMS?",
                "Bolehkah saya menggunakan LMS untuk belajar lagi setelah lulus program?",
                "Materi LMS masih bisa diakses nggak setelah selesai program?",
                "Apakah materi di LMS tetap tersedia setelah program selesai?",
                "Jika program sudah selesai, apakah LMS tetap bisa diakses?",
                "LMS masih bisa diakses setelah program selesai atau tidak?",
                "Apakah materi di LMS akan tetap tersedia setelah program ini selesai?",
                "Bisakah saya mengakses materi LMS setelah menyelesaikan program ini?",
                "Setelah selesai program, apakah saya masih dapat membuka materi di LMS?",
                "Apakah akses ke platform LMS tetap aktif setelah pelatihan selesai?",
                "Bolehkah saya mengakses ulang materi di LMS usai program berakhir?",
                "Apakah saya bisa belajar kembali melalui LMS ketika program sudah selesai?",
                "Apakah LMS tetap tersedia setelah pelatihan usai?",
                "Bagaimana dengan akses materi LMS setelah program selesai?",
                "Apakah saya bisa login ke LMS setelah program ditutup?",
                "Apakah akses LMS dipertahankan setelah program selesai?",
                "Bisa nggak saya pakai LMS lagi setelah program resmi selesai?",
                "Apakah saya masih memiliki akses ke materi di LMS setelah program berakhir?"
            ],
            "responses": [
                "Sayangnya, akses ke LMS akan ditutup setelah program selesai. Jadi pastikan kamu sudah memanfaatkan semua materi selama program berlangsung ya!",
                "Mohon maaf, kamu tidak bisa lagi mengakses LMS setelah program berakhir. Jadi jangan lupa untuk menyelesaikan semua materi sebelum program selesai!",
                "Akses LMS hanya tersedia selama program berjalan. Jadi pastikan kamu belajar maksimal dan mencatat hal-hal penting sebelum program berakhir!",
                "Setelah program selesai, akses ke LMS tidak lagi tersedia. Jadi manfaatkan waktu kamu sekarang untuk menyerap semua materi yang ada!",
                "Sayangnya, LMS hanya bisa diakses selama program berlangsung. Jadi gunakan kesempatan ini untuk mempelajari materi sebanyak mungkin!",
                "Maaf ya, setelah program selesai kamu tidak dapat mengakses LMS lagi. Jadi pastikan kamu sudah menyelesaikan semua materi sebelum waktunya habis!",
                "LMS akan ditutup setelah program selesai, jadi maksimalkan waktu yang ada untuk belajar dan mencatat semua materi yang penting!",
                "Akses ke LMS akan berakhir setelah program selesai. Jadi pastikan kamu menyelesaikan materi dan memahami isinya sebelum program berakhir ya!",
                "Setelah program selesai, kamu tidak akan bisa lagi masuk ke LMS. Jadi manfaatkan kesempatan ini untuk belajar semaksimal mungkin!",
                "LMS hanya dapat diakses selama program berlangsung. Jadi pastikan kamu sudah belajar dengan baik dan menyimpan materi penting sebelum program selesai!",
                "Setelah program berakhir, akses ke LMS otomatis akan ditutup, jadi pastikan kamu sudah memanfaatkan semua materi selama program.",
                "Sayangnya, LMS tidak dapat diakses lagi setelah pelatihan selesai. Jadi manfaatkan waktu sebaik mungkin saat program berjalan.",
                "Akses LMS akan berhenti saat program selesai, jadi usahakan untuk menyelesaikan semua materi sebelum waktunya habis.",
                "Materi di LMS hanya bisa diakses selama periode program berlangsung, setelah itu akses akan dicabut.",
                "Kamu tidak dapat membuka LMS lagi setelah program selesai, jadi pastikan semua materi sudah kamu pelajari dengan baik.",
                "LMS hanya aktif selama durasi program. Setelah itu, kamu tidak bisa mengakses materi lagi di platform tersebut.",
                "Setelah pelatihan selesai, akses ke LMS akan dinonaktifkan, jadi gunakan kesempatan belajar selama program masih berjalan.",
                "Akses ke LMS akan berakhir bersamaan dengan selesainya program, jadi jangan lupa untuk menyelesaikan semua tugas dan materi.",
                "Platform LMS akan tertutup setelah program berakhir, sehingga kamu tidak bisa lagi mengakses konten di dalamnya.",
                "Begitu program selesai, kamu tidak akan bisa mengakses materi di LMS lagi. Jadi manfaatkan sebaik mungkin selama program aktif."
            ]
        },
        {
            "tag": "fallback",
            "patterns": [],
            "responses": [
                "Maaf, ILO belum mengerti pertanyaan itu. Bisa coba ditanyakan dengan cara lain?"
            ]
        }
    ]
}
